Lingjia007/STM32F407_Bootloader/IAP/menu.c
  res = f_mount(&SDFatFS, (TCHAR const *)SDPath, 1);
  if (res != FR_OK)
  {
    menu_service_print(ctx, "Error: SD card mount failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, res);
    menu_service_println(ctx, msg);
    return;
  }

  menu_service_println(ctx, "Scanning for bin and aes files...\r");
  scan_sd_card_files();

  if (file_count == 0)
  {
    menu_service_println(ctx, "No bin or aes files found on SD card!");
    f_mount(NULL, (TCHAR const *)SDPath, 0);
    return;
  }

  menu_service_println(ctx, "Found bin and aes files:");
  for (i = 0; i < file_count; i++)
  {
    snprintf(msg, sizeof(msg), "  [%c] %s", index_to_sel_char(i), file_list[i]);
    menu_service_println(ctx, msg);
  }

  build_sel_range_str(file_count, range_str, sizeof(range_str));
  menu_service_printf(ctx, "\r\nSelect file (%s) or 'q' to abort: ", range_str);
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == 'q' || key == 'Q')
    {
      menu_service_println(ctx, "\rAborted by user.");
      f_mount(NULL, (TCHAR const *)SDPath, 0);
      return;
    }
    selected = sel_char_to_index((char)key);
    if (selected < file_count)
      break;
  }

  snprintf(msg, sizeof(msg), "\r\nSelected: %s", file_list[selected]);
  menu_service_println(ctx, msg);

  target_slot = ab_partition_get_inactive_slot();
  snprintf(msg, sizeof(msg), "Target slot: %s (inactive)", ab_slot_name(target_slot));
  menu_service_println(ctx, msg);
  menu_service_print(ctx, "Download to slot A(1) or slot B(2)? [default=inactive]: ");
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, 100);
    if (key == '1')
    {
      target_slot = AB_SLOT_A;
      break;
    }
    else if (key == '2')
    {
      target_slot = AB_SLOT_B;
      break;
    }
    else if (key == '\r' || key == '\n' || key == 0)
    {
      break;
    }
  }

  snprintf(msg, sizeof(msg), "\r\nDownloading to Slot %s (0x%08lX)...",
           ab_slot_name(target_slot), (unsigned long)ab_partition_get_slot_addr(target_slot));
  menu_service_println(ctx, msg);

  if (target_slot == AB_SLOT_A)
    target_flash = &g_slot_a_flash;
  else
    target_flash = &g_slot_b_flash;

  g_fatfs_transport.fs = &SDFatFS;
  strncpy(bootloader_ctx.config.storage.fatfs_path, file_list[selected], sizeof(bootloader_ctx.config.storage.fatfs_path) - 1);
  bootloader_ctx.config.storage.fatfs_path[sizeof(bootloader_ctx.config.storage.fatfs_path) - 1] = '\0';

  err = bootloader_download(&g_fatfs_transport.base, &target_flash->transport_base, bootloader_ctx.config.storage.fatfs_path);

  if (err == BOOTLOADER_OK)
  {
    ab_partition_update_slot_meta(target_slot, 0, 0, 0, NULL);
    ab_partition_set_active_slot(target_slot);
    snprintf(msg, sizeof(msg), "Firmware update to Slot %s completed!", ab_slot_name(target_slot));
    menu_service_println(ctx, msg);
    menu_service_println(ctx, "Slot marked as TESTING, will activate on next boot.");
  }
  else
  {
    menu_service_print(ctx, "Firmware update failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, (uint32_t)(-err));
    menu_service_println(ctx, msg);
  }

  f_mount(NULL, (TCHAR const *)SDPath, 0);
}

static void cmd_spi_flash_download(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[128];
  char range_str[16];
  int res;
  bootloader_err_t err;
  lfs_t lfs;
  ab_slot_t target_slot;
  internal_flash_stm32_t *target_flash;

  menu_service_println(ctx, "Initializing SPI Flash...");

  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(ctx, "Error: SPI Flash initialization failed!");
    return;
  }

  menu_service_println(ctx, "Mounting LittleFS...");
  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_print(ctx, "Error: LittleFS mount failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, (uint32_t)(-res));
    menu_service_println(ctx, msg);
    return;
  }

  menu_service_println(ctx, "Scanning for bin and aes files...\r");
  scan_lfs_files(&lfs);

  if (file_count == 0)
  {
    menu_service_println(ctx, "No bin or aes files found on SPI Flash!");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  menu_service_println(ctx, "Found bin and aes files:");
  for (i = 0; i < file_count; i++)
  {
    snprintf(msg, sizeof(msg), "  [%c] %s", index_to_sel_char(i), file_list[i]);
    menu_service_println(ctx, msg);
  }

  build_sel_range_str(file_count, range_str, sizeof(range_str));
  menu_service_printf(ctx, "\r\nSelect file (%s) or 'q' to abort: ", range_str);
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == 'q' || key == 'Q')
    {
      menu_service_println(ctx, "\rAborted by user.");
      lfs_spi_flash_unmount(&lfs);
      return;
    }
    selected = sel_char_to_index((char)key);
    if (selected < file_count)
      break;
  }

  snprintf(msg, sizeof(msg), "\r\nSelected: %s", file_list[selected]);
  menu_service_println(ctx, msg);

  target_slot = ab_partition_get_inactive_slot();
  snprintf(msg, sizeof(msg), "Target slot: %s (inactive)", ab_slot_name(target_slot));
  menu_service_println(ctx, msg);
  menu_service_print(ctx, "Download to slot A(1) or slot B(2)? [default=inactive]: ");
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, 100);
    if (key == '1')
    {
      target_slot = AB_SLOT_A;
      break;
    }
    else if (key == '2')
    {
      target_slot = AB_SLOT_B;
      break;
    }
    else if (key == '\r' || key == '\n' || key == 0)
    {
      break;
    }
  }

  snprintf(msg, sizeof(msg), "\r\nDownloading to Slot %s (0x%08lX)...",
           ab_slot_name(target_slot), (unsigned long)ab_partition_get_slot_addr(target_slot));
  menu_service_println(ctx, msg);

  if (target_slot == AB_SLOT_A)
    target_flash = &g_slot_a_flash;
  else
    target_flash = &g_slot_b_flash;

  g_lfs_transport.lfs = &lfs;
  strncpy(bootloader_ctx.config.storage.lfs_path, file_list[selected], sizeof(bootloader_ctx.config.storage.lfs_path) - 1);
  bootloader_ctx.config.storage.lfs_path[sizeof(bootloader_ctx.config.storage.lfs_path) - 1] = '\0';

  err = bootloader_download(&g_lfs_transport.base, &target_flash->transport_base, bootloader_ctx.config.storage.lfs_path);

  if (err == BOOTLOADER_OK)
  {
    ab_partition_update_slot_meta(target_slot, 0, 0, 0, NULL);
    ab_partition_set_active_slot(target_slot);
    snprintf(msg, sizeof(msg), "Firmware update to Slot %s completed!", ab_slot_name(target_slot));
    menu_service_println(ctx, msg);
    menu_service_println(ctx, "Slot marked as TESTING, will activate on next boot.");
  }
  else
  {
    menu_service_print(ctx, "Firmware update failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, (uint32_t)(-err));
    menu_service_println(ctx, msg);
  }

  lfs_spi_flash_unmount(&lfs);
}
#endif

