Lingjia007/STM32F407_Bootloader/IAP/menu.c
#if MENU_ENABLE_UPLOAD
static void cmd_serial_upload(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t status = 0;
  char msg[128];
  ab_slot_t active = ab_partition_get_active_slot();
  uint32_t upload_addr = ab_partition_get_slot_addr(active);
  uint32_t upload_size = ab_partition_get_slot_size(active);

  snprintf(msg, sizeof(msg), "\n\nUploading from Slot %s (0x%08lX)\n", ab_slot_name(active), (unsigned long)upload_addr);
  menu_service_println(ctx, msg);
  menu_service_println(ctx, "Select Receive File\n");
  menu_service_getchar(ctx, &status, RX_TIMEOUT);
  if (status == CRC16)
  {
    status = Ymodem_Transmit((uint8_t *)upload_addr, (const uint8_t *)"UploadedFlashImage.bin", upload_size);
    if (status != 0)
    {
      menu_service_println(ctx, "\nError Occurred while Transmitting File\n");
    }
    else
    {
      menu_service_println(ctx, "\nFile uploaded successfully \n");
    }
  }
}
#endif

#if MENU_ENABLE_EXECUTE_APP
static void cmd_execute_app(menu_ctx_t *ctx, int argc, char *argv[])
{
  char msg[128];
  ab_slot_t active = ab_partition_get_active_slot();
  snprintf(msg, sizeof(msg), "Start program execution from Slot %s......\n", ab_slot_name(active));
  menu_service_println(ctx, msg);
  bootloader_ctx.ab_active_slot = active;
  bootloader_request_jump(active);
}
#endif

#if MENU_ENABLE_FLASH_PROTECTION
static void cmd_flash_protection(menu_ctx_t *ctx, int argc, char *argv[])
{
  FlashProtection = INTERNAL_FLASH_GET_PROTECTION_STATUS(&g_internal_flash.flash_base);

  if (FlashProtection != INTERNAL_FLASH_PROTECTION_NONE)
  {
    if (INTERNAL_FLASH_SET_PROTECTION(&g_internal_flash.flash_base, 0, 0) == INTERNAL_FLASH_STATUS_OK)
    {
      menu_service_println(ctx, "Write Protection disabled...");
      menu_service_println(ctx, "System will now restart...");
      HAL_FLASH_OB_Launch();
      HAL_FLASH_Unlock();
    }
    else
    {
      menu_service_println(ctx, "Error: Flash write un-protection failed...");
    }
  }
  else
  {
    if (INTERNAL_FLASH_SET_PROTECTION(&g_internal_flash.flash_base,
                                      OB_WRP_SECTOR_5 | OB_WRP_SECTOR_6 | OB_WRP_SECTOR_7 |
                                          OB_WRP_SECTOR_8 | OB_WRP_SECTOR_9 | OB_WRP_SECTOR_10 | OB_WRP_SECTOR_11,
                                      1) == INTERNAL_FLASH_STATUS_OK)
    {
      menu_service_println(ctx, "Write Protection enabled...");
      menu_service_println(ctx, "System will now restart...");
      HAL_FLASH_OB_Launch();
    }
    else
    {
      menu_service_println(ctx, "Error: Flash write protection failed...");
    }
  }
}
#endif

#if MENU_ENABLE_UART_PASSTHROUGH
static void cmd_uart_passthrough(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t rx_data;
  uint8_t q_count = 0;
  uint32_t q_timer = 0;
  platform_uart_base_t *uart4 = &g_uart4_console.base;
  platform_uart_base_t *usart1 = &g_usart1_esp8266.base;

  menu_service_println(ctx, "\r\n========== UART4 <-> USART1 Passthrough Mode ==========");
  menu_service_println(ctx, "  UART4 (PA0/PA1) <--> USART1 (PA9/PA10)");
  menu_service_println(ctx, "  Baud Rate: 115200, 8N1");
  menu_service_println(ctx, "  For ESP8266/BLE AT Command Debug");
  menu_service_println(ctx, "  Press 'q' 3 times within 1 second to exit");
  menu_service_println(ctx, "========================================================\n");

  UART_ABORT(usart1);
  UART_DISABLE_IT(usart1, PLATFORM_UART_IT_RXNE);
  UART_DISABLE_IT(usart1, PLATFORM_UART_IT_IDLE);
  UART_FLUSH(uart4);
  UART_FLUSH(usart1);
  UART_CLEAR_FLAG(uart4, PLATFORM_UART_FLAG_ORE);
  UART_CLEAR_FLAG(usart1, PLATFORM_UART_FLAG_ORE);

  while (1)
  {
    if (UART_GET_FLAG(uart4, PLATFORM_UART_FLAG_RXNE))
    {
      rx_data = UART_READ_BYTE(uart4);
      if (rx_data == 'q')
      {
        if (q_count == 0 || (HAL_GetTick() - q_timer) < 1000)
        {
          q_count++;
          q_timer = HAL_GetTick();
          if (q_count >= 3)
          {
            menu_service_println(ctx, "\n\nExiting passthrough mode...");
            UART_ENABLE_IT(usart1, PLATFORM_UART_IT_RXNE);
            UART_ENABLE_IT(usart1, PLATFORM_UART_IT_IDLE);
            return;
          }
        }
        else
        {
          q_count = 1;
          q_timer = HAL_GetTick();
        }
        while (!UART_GET_FLAG(usart1, PLATFORM_UART_FLAG_TXE))
          ;
        UART_WRITE_BYTE(usart1, rx_data);
      }
      else
      {
        q_count = 0;
        while (!UART_GET_FLAG(usart1, PLATFORM_UART_FLAG_TXE))
          ;
        UART_WRITE_BYTE(usart1, rx_data);
      }
    }
    else if (UART_GET_FLAG(uart4, PLATFORM_UART_FLAG_ORE))
    {
      UART_CLEAR_FLAG(uart4, PLATFORM_UART_FLAG_ORE);
    }

    if (UART_GET_FLAG(usart1, PLATFORM_UART_FLAG_RXNE))
    {
      rx_data = UART_READ_BYTE(usart1);
      while (!UART_GET_FLAG(uart4, PLATFORM_UART_FLAG_TXE))
        ;
      UART_WRITE_BYTE(uart4, rx_data);
    }
    else if (UART_GET_FLAG(usart1, PLATFORM_UART_FLAG_ORE))
    {
      UART_CLEAR_FLAG(usart1, PLATFORM_UART_FLAG_ORE);
    }
  }
}
#endif

#if MENU_ENABLE_SPI_FLASH_STORE
static void ShowStoredImages(lfs_t *lfs)
{
  lfs_dir_t dir;
  struct lfs_info info;
  int res;
  uint8_t count = 0;
  char msg[128];

  menu_service_println(&g_menu_ctx, "Stored images in SPI Flash:");
  menu_service_println(&g_menu_ctx, "========================================");

  res = lfs_dir_open(lfs, &dir, "/");
  if (res != LFS_ERR_OK)
  {
    menu_service_println(&g_menu_ctx, "Error: Cannot open directory!");
    return;
  }

  while (1)
  {
    res = lfs_dir_read(lfs, &dir, &info);
    if (res <= 0)
      break;
    if (info.type == LFS_TYPE_REG)
    {
      count++;
      snprintf(msg, sizeof(msg), "  [%c] %s  Size: %u bytes", index_to_sel_char(count - 1), info.name, (unsigned int)info.size);
      menu_service_println(&g_menu_ctx, msg);
    }
  }
  lfs_dir_close(lfs, &dir);

  if (count == 0)
    menu_service_println(&g_menu_ctx, "  No images stored.");
  menu_service_println(&g_menu_ctx, "========================================");
}

static void DeleteStoredImage(lfs_t *lfs)
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[128];
  char range_str[16];
  int res;

