Lingjia007/STM32F407_Bootloader/IAP/menu.c
  scan_lfs_files(lfs);
  if (file_count == 0)
  {
    menu_service_println(&g_menu_ctx, "No images found to delete!");
    return;
  }

  menu_service_println(&g_menu_ctx, "Select image to delete:");
  for (i = 0; i < file_count; i++)
  {
    snprintf(msg, sizeof(msg), "  [%c] %s", index_to_sel_char(i), file_list[i]);
    menu_service_println(&g_menu_ctx, msg);
  }

  build_sel_range_str(file_count, range_str, sizeof(range_str));
  menu_service_printf(&g_menu_ctx, "\r\nEnter selection (%s) or 'q' to abort: ", range_str);
  menu_service_flush(&g_menu_ctx);

  while (1)
  {
    menu_service_getchar(&g_menu_ctx, &key, RX_TIMEOUT);
    if (key == 'q' || key == 'Q')
    {
      menu_service_println(&g_menu_ctx, "\rAborted by user.");
      return;
    }
    selected = sel_char_to_index((char)key);
    if (selected < file_count)
      break;
  }

  snprintf(msg, sizeof(msg), "\rDeleting: %s", file_list[selected]);
  menu_service_println(&g_menu_ctx, msg);

  res = lfs_remove(lfs, file_list[selected]);
  if (res == LFS_ERR_OK)
    menu_service_println(&g_menu_ctx, "Image deleted successfully!");
  else
    menu_service_println(&g_menu_ctx, "Error: Failed to delete image!");
}

static void DeleteEntireFS(lfs_t *lfs)
{
  uint8_t key = 0;
  int res;

  menu_service_println(&g_menu_ctx, "WARNING: This will delete ALL files in SPI Flash!");
  menu_service_print(&g_menu_ctx, "Press 'y' to confirm, any other key to abort: ");
  menu_service_flush(&g_menu_ctx);
  menu_service_getchar(&g_menu_ctx, &key, RX_TIMEOUT);

  if (key != 'y' && key != 'Y')
  {
    menu_service_println(&g_menu_ctx, "\rAborted by user.");
    return;
  }

  menu_service_println(&g_menu_ctx, "\rFormatting SPI Flash file system...");

  res = lfs_unmount(lfs);
  if (res != LFS_ERR_OK)
    menu_service_println(&g_menu_ctx, "Warning: Unmount failed, continuing...");

  res = lfs_format(lfs, &lfs_spi_flash_cfg);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(&g_menu_ctx, "Error: Format failed!");
    return;
  }

  res = lfs_mount(lfs, &lfs_spi_flash_cfg);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(&g_menu_ctx, "Error: Remount failed!");
    return;
  }

  menu_service_println(&g_menu_ctx, "File system formatted successfully!");
}

static void StoreFromTFCard(void)
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[256];
  char range_str[16];
  int res;
  bootloader_err_t err;
  lfs_t lfs;

  menu_service_println(&g_menu_ctx, "Initializing TF card...");

  res = f_mount(&SDFatFS, (TCHAR const *)SDPath, 1);
  if (res != FR_OK)
  {
    menu_service_print(&g_menu_ctx, "Error: SD card mount failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, res);
    menu_service_println(&g_menu_ctx, msg);
    return;
  }

  menu_service_println(&g_menu_ctx, "Initializing SPI Flash...");
  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(&g_menu_ctx, "Error: SPI Flash initialization failed!");
    f_mount(NULL, (TCHAR const *)SDPath, 0);
    return;
  }

  menu_service_println(&g_menu_ctx, "Mounting LittleFS...");
  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(&g_menu_ctx, "Error: LittleFS mount failed!");
    f_mount(NULL, (TCHAR const *)SDPath, 0);
    return;
  }

  menu_service_println(&g_menu_ctx, "Scanning TF card for bin, aes, hdiff and sig files...\r");
  scan_sd_card_files();

  if (file_count == 0)
  {
    menu_service_println(&g_menu_ctx, "No bin, aes, hdiff or sig files found on TF card!");
    lfs_spi_flash_unmount(&lfs);
    f_mount(NULL, (TCHAR const *)SDPath, 0);
    return;
  }

  menu_service_println(&g_menu_ctx, "Found files:");
  for (i = 0; i < file_count; i++)
  {
    snprintf(msg, sizeof(msg), "  [%c] %s", index_to_sel_char(i), file_list[i]);
    menu_service_println(&g_menu_ctx, msg);
  }

  build_sel_range_str(file_count, range_str, sizeof(range_str));
  menu_service_printf(&g_menu_ctx, "\r\nSelect file to store (%s) or 'q' to abort: ", range_str);
  menu_service_flush(&g_menu_ctx);

  while (1)
  {
    menu_service_getchar(&g_menu_ctx, &key, RX_TIMEOUT);
    if (key == 'q' || key == 'Q')
    {
      menu_service_println(&g_menu_ctx, "\rAborted by user.");
      lfs_spi_flash_unmount(&lfs);
      f_mount(NULL, (TCHAR const *)SDPath, 0);
      return;
    }
    selected = sel_char_to_index((char)key);
    if (selected < file_count)
      break;
  }

  snprintf(msg, sizeof(msg), "\rSelected: %s", file_list[selected]);
  menu_service_println(&g_menu_ctx, msg);
  menu_service_println(&g_menu_ctx, "Storing image to SPI Flash...");

  g_fatfs_transport.fs = &SDFatFS;
  g_lfs_transport.lfs = &lfs;
  strncpy(bootloader_ctx.config.storage.fatfs_path, file_list[selected], sizeof(bootloader_ctx.config.storage.fatfs_path) - 1);
  bootloader_ctx.config.storage.fatfs_path[sizeof(bootloader_ctx.config.storage.fatfs_path) - 1] = '\0';
  strncpy(bootloader_ctx.config.storage.lfs_path, file_list[selected], sizeof(bootloader_ctx.config.storage.lfs_path) - 1);
  bootloader_ctx.config.storage.lfs_path[sizeof(bootloader_ctx.config.storage.lfs_path) - 1] = '\0';

  err = bootloader_download(&g_fatfs_transport.base, &g_lfs_transport.base, bootloader_ctx.config.storage.lfs_path);

  if (err == BOOTLOADER_OK)
    menu_service_println(&g_menu_ctx, "Image stored successfully!");
  else
  {
    menu_service_print(&g_menu_ctx, "Store failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, (uint32_t)(-err));
    menu_service_println(&g_menu_ctx, msg);
  }

  lfs_spi_flash_unmount(&lfs);
  f_mount(NULL, (TCHAR const *)SDPath, 0);
}

static void StoreFromInternalFlash(void)
{
  uint8_t key = 0;
  char filename[64];
  char msg[256];
  char size_str[16];
  uint8_t idx = 0;
  uint32_t size = 0;
  uint32_t flash_addr;
  uint32_t flash_size;
  int res;
  lfs_t lfs;
  lfs_file_t file;
  uint8_t buffer[256];
  uint32_t bytes_written = 0;
  uint32_t total_written = 0;

  menu_service_println(&g_menu_ctx, "Initializing SPI Flash...");
  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(&g_menu_ctx, "Error: SPI Flash initialization failed!");
    return;
  }

  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(&g_menu_ctx, "Error: LittleFS mount failed!");
    return;
  }

