Lingjia007/STM32F407_Bootloader/IAP/menu.c
  menu_service_print(&g_menu_ctx, "\r\nEnter filename (with .bin, .bin.aes, .hdiff or .sig extension): ");
  idx = 0;
  menu_service_flush(&g_menu_ctx);

  while (1)
  {
    menu_service_getchar(&g_menu_ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      filename[idx] = '\0';
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        menu_service_print(&g_menu_ctx, "\b \b");
      }
    }
    else if (idx < sizeof(filename) - 1 && key >= 0x20 && key <= 0x7E)
    {
      filename[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(&g_menu_ctx, echo_ch);
    }
  }

  if (idx == 0)
  {
    menu_service_println(&g_menu_ctx, "\rError: Empty filename!");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  if (!check_file_extension(filename))
  {
    menu_service_println(&g_menu_ctx, "\rError: Invalid file extension! Must be .bin, .bin.aes, .hdiff or .sig");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  menu_service_print(&g_menu_ctx, "\r\nEnter size in bytes (or 'm' for max): ");
  idx = 0;
  menu_service_flush(&g_menu_ctx);

  while (1)
  {
    menu_service_getchar(&g_menu_ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      size_str[idx] = '\0';
      break;
    }
    else if (idx < sizeof(size_str) - 1)
    {
      if ((key >= '0' && key <= '9') || (idx == 0 && (key == 'm' || key == 'M')))
      {
        size_str[idx++] = key;
        char echo_ch[2] = {(char)key, '\0'};
        menu_service_print(&g_menu_ctx, echo_ch);
      }
    }
  }

  if (idx == 0)
  {
    menu_service_println(&g_menu_ctx, "\rError: Empty size!");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  if (size_str[0] == 'm' || size_str[0] == 'M')
  {
    size = USER_FLASH_SIZE;
  }
  else
  {
    size = 0;
    for (idx = 0; size_str[idx] != '\0'; idx++)
    {
      if (size_str[idx] >= '0' && size_str[idx] <= '9')
        size = size * 10 + (size_str[idx] - '0');
    }
  }

  if (size == 0 || size > USER_FLASH_SIZE)
  {
    menu_service_println(&g_menu_ctx, "\rError: Invalid size!");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  snprintf(msg, sizeof(msg), "\rFilename: %s, Size: %u bytes", filename, (unsigned int)size);
  menu_service_println(&g_menu_ctx, msg);
  menu_service_print(&g_menu_ctx, "Confirm? (y/n): ");
  menu_service_flush(&g_menu_ctx);
  menu_service_getchar(&g_menu_ctx, &key, RX_TIMEOUT);

  if (key != 'y' && key != 'Y')
  {
    menu_service_println(&g_menu_ctx, "\rAborted by user.");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  menu_service_println(&g_menu_ctx, "\rStoring from Internal Flash to SPI Flash...");

  res = lfs_file_open(&lfs, &file, filename, LFS_O_WRONLY | LFS_O_CREAT | LFS_O_TRUNC);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(&g_menu_ctx, "Error: Cannot create file!");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  flash_addr = ab_partition_get_slot_addr(ab_partition_get_active_slot());
  flash_size = size;

  while (total_written < flash_size)
  {
    uint32_t to_write = sizeof(buffer);
    if (flash_size - total_written < to_write)
      to_write = flash_size - total_written;

    memcpy(buffer, (uint8_t *)(flash_addr + total_written), to_write);
    bytes_written = lfs_file_write(&lfs, &file, buffer, to_write);
    if (bytes_written != to_write)
    {
      menu_service_println(&g_menu_ctx, "Error: Write failed!");
      lfs_file_close(&lfs, &file);
      lfs_spi_flash_unmount(&lfs);
      return;
    }

    total_written += to_write;
    if ((total_written % 4096) == 0 || total_written == flash_size)
    {
      snprintf(msg, sizeof(msg), "Progress: %u / %u bytes\r", (unsigned int)total_written, (unsigned int)flash_size);
      menu_service_print(&g_menu_ctx, msg);
    }
  }

  lfs_file_close(&lfs, &file);
  lfs_spi_flash_unmount(&lfs);
  menu_service_println(&g_menu_ctx, "\rImage stored successfully!");
}

static void cmd_store_from_tf(menu_ctx_t *ctx, int argc, char *argv[])
{
  StoreFromTFCard();
}

static void cmd_store_from_flash(menu_ctx_t *ctx, int argc, char *argv[])
{
  StoreFromInternalFlash();
}

static void cmd_show_stored(menu_ctx_t *ctx, int argc, char *argv[])
{
  lfs_t lfs;
  int res;

  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(ctx, "Error: SPI Flash init failed!");
    return;
  }

  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(ctx, "Error: Cannot mount SPI Flash!");
    return;
  }

  ShowStoredImages(&lfs);
  lfs_spi_flash_unmount(&lfs);
}

static void cmd_delete_stored(menu_ctx_t *ctx, int argc, char *argv[])
{
  lfs_t lfs;
  int res;

  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(ctx, "Error: SPI Flash init failed!");
    return;
  }

  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(ctx, "Error: Cannot mount SPI Flash!");
    return;
  }

  DeleteStoredImage(&lfs);
  lfs_spi_flash_unmount(&lfs);
}

static void cmd_delete_fs(menu_ctx_t *ctx, int argc, char *argv[])
{
  lfs_t lfs;
  int res;

  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(ctx, "Error: SPI Flash init failed!");
    return;
  }

  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(ctx, "Error: Cannot mount SPI Flash!");
    return;
  }

  DeleteEntireFS(&lfs);
  lfs_spi_flash_unmount(&lfs);
}
#endif

#if MENU_ENABLE_FIRMWARE_PACKAGE

#define FW_PKG_IAP_EXT ".iap.bin"
#define FW_PKG_IAP_EXT_UPPER ".IAP.BIN"

static uint8_t fw_pkg_is_iap_file(const char *filename)
{
  size_t len = strlen(filename);
  if (len >= 8)
  {
    const char *ext = filename + len - 8;
    if (strcmp(ext, FW_PKG_IAP_EXT) == 0 || strcmp(ext, FW_PKG_IAP_EXT_UPPER) == 0)
      return 1;
  }
  return 0;
}

static void fw_pkg_print_header_detail(menu_ctx_t *ctx, const fw_pkg_header_t *hdr)
{
  char msg[256];

  menu_service_println(ctx, "");
  menu_service_println(ctx, "======== Firmware Package Header ========");
  snprintf(msg, sizeof(msg), "  Magic:            0x%08lX", (unsigned long)hdr->magic);
  menu_service_println(ctx, msg);
  snprintf(msg, sizeof(msg), "  Header Version:   %u", hdr->header_version);
  menu_service_println(ctx, msg);
  snprintf(msg, sizeof(msg), "  Firmware Version:  v%u.%u.%u",
           hdr->firmware_major, hdr->firmware_minor, hdr->firmware_patch);
  menu_service_println(ctx, msg);
  snprintf(msg, sizeof(msg), "  Payload Size:     %lu bytes", (unsigned long)hdr->total_payload_size);
  menu_service_println(ctx, msg);

  const char *img_type_str = "Unknown";
  switch (hdr->image_type)
  {
  case FW_PKG_IMAGE_APP:
    img_type_str = "App (0x01)";
    break;
  case FW_PKG_IMAGE_BOOTLOADER:
    img_type_str = "Bootloader (0x02)";
    break;
  case FW_PKG_IMAGE_RESOURCE:
    img_type_str = "Resource (0x03)";
    break;
  }
  snprintf(msg, sizeof(msg), "  Image Type:       %s", img_type_str);
  menu_service_println(ctx, msg);

  const char *enc_str = "None";
  switch (hdr->encryption_algo)
  {
  case FW_PKG_ENC_NONE:
    enc_str = "None (0x00)";
    break;
  case FW_PKG_ENC_AES256_CBC:
    enc_str = "AES-256-CBC (0x01)";
    break;
  case FW_PKG_ENC_AES256_ECB:
    enc_str = "AES-256-ECB (0x02)";
    break;
  case FW_PKG_ENC_AES256_CTR:
    enc_str = "AES-256-CTR (0x03)";
    break;
  }
  snprintf(msg, sizeof(msg), "  Encryption:       %s", enc_str);
  menu_service_println(ctx, msg);

