Lingjia007/STM32F407_Bootloader/IAP/menu.c
  const char *sig_str = "None";
  if (hdr->signature_algo == FW_PKG_SIG_ED25519)
    sig_str = "Ed25519 (0x01)";
  snprintf(msg, sizeof(msg), "  Signature:        %s", sig_str);
  menu_service_println(ctx, msg);

  snprintf(msg, sizeof(msg), "  Hardware Compat:  0x%08lX", (unsigned long)hdr->hardware_compat);
  menu_service_println(ctx, msg);
  snprintf(msg, sizeof(msg), "  Security Counter: %lu", (unsigned long)hdr->security_counter);
  menu_service_println(ctx, msg);
  snprintf(msg, sizeof(msg), "  Build Timestamp:  %lu", (unsigned long)hdr->build_timestamp);
  menu_service_println(ctx, msg);

  static char hmac_hex[65];
  for (int i = 0; i < 32; i++)
    snprintf(&hmac_hex[i * 2], sizeof(hmac_hex) - i * 2, "%02X", hdr->header_checksum[i]);
  hmac_hex[64] = '\0';
  snprintf(msg, sizeof(msg), "  HMAC:             %s...", hmac_hex);
  menu_service_println(ctx, msg);

  uint32_t cipher_size = hdr->total_payload_size - FW_PKG_SALT_SIZE - FW_PKG_IV_SIZE;
  snprintf(msg, sizeof(msg), "  Ciphertext Size:  %lu bytes", (unsigned long)cipher_size);
  menu_service_println(ctx, msg);
  menu_service_println(ctx, "==========================================");
}

static void fw_pkg_print_verify_config(menu_ctx_t *ctx, const fw_pkg_verify_config_t *config)
{
  char msg[256];
  static char hex_buf[65];

  menu_service_println(ctx, "");
  menu_service_println(ctx, "======== Verify Configuration ========");
  if (config->devkey)
  {
    for (size_t i = 0; i < config->devkey_len; i++)
      snprintf(&hex_buf[i * 2], sizeof(hex_buf) - i * 2, "%02X", config->devkey[i]);
    hex_buf[config->devkey_len * 2] = '\0';
    snprintf(msg, sizeof(msg), "  DevKey (%uB):     %s", (unsigned)config->devkey_len, hex_buf);
    menu_service_println(ctx, msg);
  }
  else
  {
    menu_service_println(ctx, "  DevKey:           NULL (no HMAC check)");
  }

  if (config->uid)
  {
    for (size_t i = 0; i < config->uid_len; i++)
      snprintf(&hex_buf[i * 2], sizeof(hex_buf) - i * 2, "%02X", config->uid[i]);
    hex_buf[config->uid_len * 2] = '\0';
    snprintf(msg, sizeof(msg), "  UID (%uB):        %s", (unsigned)config->uid_len, hex_buf);
    menu_service_println(ctx, msg);
  }

  if (config->ed25519_pubkey)
  {
    for (size_t i = 0; i < config->ed25519_pubkey_len && i < 8; i++)
      snprintf(&hex_buf[i * 2], sizeof(hex_buf) - i * 2, "%02X", config->ed25519_pubkey[i]);
    hex_buf[16] = '\0';
    snprintf(msg, sizeof(msg), "  PubKey (%uB):     %s...", (unsigned)config->ed25519_pubkey_len, hex_buf);
    menu_service_println(ctx, msg);
  }
  else
  {
    menu_service_println(ctx, "  PubKey:           NULL (no signature check)");
  }

  snprintf(msg, sizeof(msg), "  HW Compat:        0x%08lX", (unsigned long)config->hardware_compat);
  menu_service_println(ctx, msg);
  snprintf(msg, sizeof(msg), "  Stored Counter:   %lu", (unsigned long)config->stored_security_counter);
  menu_service_println(ctx, msg);
  menu_service_println(ctx, "======================================");
}

static fw_pkg_err_t fw_pkg_process_and_save(
    menu_ctx_t *ctx,
    platform_fs_base_t *src_fs,
    const char *src_path,
    platform_fs_base_t *dst_fs,
    const char *dst_path,
    const fw_pkg_verify_config_t *config)
{
  platform_fs_file_t src_file, dst_file;
  fw_pkg_ctx_t pkg_ctx;
  int16_t fs_err;
  int32_t io_result;
  uint32_t total_read = 0;
  uint32_t total_written = 0;
  uint32_t bytes_read = 0;
  uint8_t aes_key[FW_PKG_AES_KEY_SIZE];
  struct sha512_state sig_state;
  uint8_t sig_pending[SHA512_BLOCK_SIZE];
  size_t sig_pending_len = 0;
  size_t sig_total_len = 0;
  char msg[256];

  static uint8_t process_buf[FW_PKG_DECRYPT_BUF_SIZE] __attribute__((aligned(4)));

  memset(&pkg_ctx, 0, sizeof(pkg_ctx));
  memset(aes_key, 0, sizeof(aes_key));

  if (config->ed25519_pubkey != NULL)
  {
    sha512_init(&sig_state);
    sig_pending_len = 0;
    sig_total_len = 0;
  }

  fs_err = FS_OPEN(src_fs, &src_file, src_path, FS_MODE_READ);
  if (fs_err != FS_STATUS_OK)
  {
    menu_service_println(ctx, "Error: Cannot open source file!");
    return FW_PKG_ERR_READ;
  }

  int32_t file_size = FS_SIZE(src_fs, &src_file);
  if (file_size < (int32_t)(FW_PKG_HEADER_SIZE + FW_PKG_SALT_SIZE + FW_PKG_IV_SIZE + FW_PKG_SIGNATURE_SIZE))
  {
    menu_service_println(ctx, "Error: File too small to be a valid package!");
    FS_CLOSE(src_fs, &src_file);
    return FW_PKG_ERR_SIZE;
  }

  snprintf(msg, sizeof(msg), "Source file size: %ld bytes", (long)file_size);
  menu_service_println(ctx, msg);

  menu_service_println(ctx, "Reading header (64 bytes)...");
  io_result = FS_READ(src_fs, &src_file, process_buf, FW_PKG_HEADER_SIZE);
  if (io_result != FW_PKG_HEADER_SIZE)
  {
    menu_service_println(ctx, "Error: Failed to read header!");
    FS_CLOSE(src_fs, &src_file);
    return FW_PKG_ERR_READ;
  }
  total_read += io_result;

  fw_pkg_err_t ret = fw_pkg_parse_header(&pkg_ctx, process_buf, io_result);
  if (ret != FW_PKG_OK)
  {
    snprintf(msg, sizeof(msg), "Error: Header parse failed: %s", fw_pkg_err_str(ret));
    menu_service_println(ctx, msg);
    FS_CLOSE(src_fs, &src_file);
    return ret;
  }

  fw_pkg_print_header_detail(ctx, &pkg_ctx.header);

  if (config->ed25519_pubkey != NULL)
  {
    fw_pkg_sha512_feed(&sig_state, process_buf, FW_PKG_HEADER_SIZE, sig_pending, &sig_pending_len);
    sig_total_len += FW_PKG_HEADER_SIZE;
  }

  if (config->devkey != NULL)
  {
    menu_service_println(ctx, "Verifying HMAC...");
    ret = fw_pkg_verify_header_hmac(&pkg_ctx, config);
    if (ret != FW_PKG_OK)
    {
      menu_service_println(ctx, "FAILED: HMAC verification failed!");
      FS_CLOSE(src_fs, &src_file);
      return ret;
    }
    menu_service_println(ctx, "HMAC verification: PASSED");
  }
  else
  {
    menu_service_println(ctx, "HMAC verification: SKIPPED (no DevKey)");
  }

  if (pkg_ctx.header.hardware_compat != config->hardware_compat)
  {
    snprintf(msg, sizeof(msg), "FAILED: HW compat mismatch (pkg=0x%08lX, board=0x%08lX)",
             (unsigned long)pkg_ctx.header.hardware_compat, (unsigned long)config->hardware_compat);
    menu_service_println(ctx, msg);
    FS_CLOSE(src_fs, &src_file);
    return FW_PKG_ERR_HW_COMPAT;
  }
  menu_service_println(ctx, "HW compat check: PASSED");

  ret = fw_pkg_check_rollback(&pkg_ctx, config);
  if (ret != FW_PKG_OK)
  {
    menu_service_println(ctx, "FAILED: Rollback detected!");
    FS_CLOSE(src_fs, &src_file);
    return ret;
  }
  menu_service_println(ctx, "Security counter check: PASSED");

  menu_service_println(ctx, "Reading DynamicSalt (16 bytes)...");
  io_result = FS_READ(src_fs, &src_file, pkg_ctx.dynamic_salt, FW_PKG_SALT_SIZE);
  if (io_result != FW_PKG_SALT_SIZE)
  {
    menu_service_println(ctx, "Error: Failed to read salt!");
    FS_CLOSE(src_fs, &src_file);
    return FW_PKG_ERR_READ;
  }
  total_read += io_result;

  {
    static char salt_hex[33];
    for (int i = 0; i < 16; i++)
      snprintf(&salt_hex[i * 2], sizeof(salt_hex) - i * 2, "%02X", pkg_ctx.dynamic_salt[i]);
    salt_hex[32] = '\0';
    snprintf(msg, sizeof(msg), "  DynamicSalt: %s", salt_hex);
    menu_service_println(ctx, msg);
  }

  if (config->ed25519_pubkey != NULL)
  {
    fw_pkg_sha512_feed(&sig_state, pkg_ctx.dynamic_salt, FW_PKG_SALT_SIZE, sig_pending, &sig_pending_len);
    sig_total_len += FW_PKG_SALT_SIZE;
  }

  menu_service_println(ctx, "Reading IV (16 bytes)...");
  io_result = FS_READ(src_fs, &src_file, pkg_ctx.iv, FW_PKG_IV_SIZE);
  if (io_result != FW_PKG_IV_SIZE)
  {
    menu_service_println(ctx, "Error: Failed to read IV!");
    FS_CLOSE(src_fs, &src_file);
    return FW_PKG_ERR_READ;
  }
  total_read += io_result;

  {
    static char iv_hex[33];
    for (int i = 0; i < 16; i++)
      snprintf(&iv_hex[i * 2], sizeof(iv_hex) - i * 2, "%02X", pkg_ctx.iv[i]);
    iv_hex[32] = '\0';
    snprintf(msg, sizeof(msg), "  IV:           %s", iv_hex);
    menu_service_println(ctx, msg);
  }

  if (config->ed25519_pubkey != NULL)
  {
    fw_pkg_sha512_feed(&sig_state, pkg_ctx.iv, FW_PKG_IV_SIZE, sig_pending, &sig_pending_len);
    sig_total_len += FW_PKG_IV_SIZE;
  }

