Lingjia007/STM32F407_Bootloader/IAP/menu.c
  if (pkg_ctx.header.encryption_algo != FW_PKG_ENC_NONE)
  {
    menu_service_println(ctx, "Deriving AES key via HKDF...");
    ret = fw_pkg_derive_aes_key(&pkg_ctx, config, aes_key);
    if (ret != FW_PKG_OK)
    {
      menu_service_println(ctx, "Error: Key derivation failed!");
      FS_CLOSE(src_fs, &src_file);
      return ret;
    }

    {
      static char key_hex[65];
      for (int i = 0; i < 32; i++)
        snprintf(&key_hex[i * 2], sizeof(key_hex) - i * 2, "%02X", aes_key[i]);
      key_hex[64] = '\0';
      snprintf(msg, sizeof(msg), "  AES-256 Key:  %s", key_hex);
      menu_service_println(ctx, msg);
    }

    ret = fw_pkg_decrypt_init(&pkg_ctx, aes_key);
    if (ret != FW_PKG_OK)
    {
      menu_service_println(ctx, "Error: AES context init failed!");
      FS_CLOSE(src_fs, &src_file);
      return ret;
    }
  }

  menu_service_println(ctx, "Opening output file for decrypted data...");
  fs_err = FS_OPEN(dst_fs, &dst_file, dst_path, FS_MODE_CREATE_ALWAYS);
  if (fs_err != FS_STATUS_OK)
  {
    snprintf(msg, sizeof(msg), "Error: Cannot create output file: %s", dst_path);
    menu_service_println(ctx, msg);
    FS_CLOSE(src_fs, &src_file);
    return FW_PKG_ERR_WRITE;
  }

  snprintf(msg, sizeof(msg), "Output: %s", dst_path);
  menu_service_println(ctx, msg);

  uint32_t ciphertext_remaining = pkg_ctx.ciphertext_size;
  uint32_t signature_offset = (uint32_t)file_size - FW_PKG_SIGNATURE_SIZE;

  menu_service_println(ctx, "Processing ciphertext...");

  while (ciphertext_remaining > 0)
  {
    uint32_t to_read = FW_PKG_DECRYPT_BUF_SIZE;
    if (ciphertext_remaining < to_read)
      to_read = ciphertext_remaining;
    if (total_read + to_read > signature_offset)
    {
      to_read = signature_offset - total_read;
      if (to_read == 0)
        break;
    }

    io_result = FS_READ(src_fs, &src_file, process_buf, to_read);
    if (io_result <= 0)
      break;

    bytes_read = (uint32_t)io_result;
    total_read += bytes_read;

    if (config->ed25519_pubkey != NULL)
    {
      fw_pkg_sha512_feed(&sig_state, process_buf, bytes_read, sig_pending, &sig_pending_len);
      sig_total_len += bytes_read;
    }

    if (pkg_ctx.header.encryption_algo != FW_PKG_ENC_NONE)
    {
      int is_final = (ciphertext_remaining == bytes_read);
      size_t actual_len = 0;
      ret = fw_pkg_decrypt_payload(&pkg_ctx, process_buf, bytes_read, is_final, &actual_len);
      if (ret != FW_PKG_OK)
      {
        menu_service_println(ctx, "Error: Decryption failed!");
        FS_CLOSE(dst_fs, &dst_file);
        FS_CLOSE(src_fs, &src_file);
        return ret;
      }
      if (is_final && actual_len < bytes_read)
      {
        bytes_read = (uint32_t)actual_len;
      }
    }

    io_result = FS_WRITE(dst_fs, &dst_file, process_buf, bytes_read);
    if (io_result != (int32_t)bytes_read)
    {
      menu_service_println(ctx, "Error: Write to output file failed!");
      FS_CLOSE(dst_fs, &dst_file);
      FS_CLOSE(src_fs, &src_file);
      return FW_PKG_ERR_WRITE;
    }
    total_written += bytes_read;
    ciphertext_remaining -= bytes_read;

    if ((total_written % 32768) == 0 || ciphertext_remaining == 0)
    {
      snprintf(msg, sizeof(msg), "  Progress: %lu / %lu bytes",
               (unsigned long)total_written, (unsigned long)pkg_ctx.ciphertext_size);
      menu_service_println(ctx, msg);
    }
  }

  if (total_read < signature_offset)
  {
    uint32_t skip = signature_offset - total_read;
    while (skip > 0)
    {
      uint32_t to_skip = (skip > FW_PKG_DECRYPT_BUF_SIZE) ? FW_PKG_DECRYPT_BUF_SIZE : skip;
      io_result = FS_READ(src_fs, &src_file, process_buf, to_skip);
      if (io_result <= 0)
        break;
      bytes_read = (uint32_t)io_result;
      if (config->ed25519_pubkey != NULL)
      {
        fw_pkg_sha512_feed(&sig_state, process_buf, bytes_read, sig_pending, &sig_pending_len);
        sig_total_len += bytes_read;
      }
      total_read += bytes_read;
      skip -= bytes_read;
    }
  }

  FS_SYNC(dst_fs, &dst_file);
  FS_CLOSE(dst_fs, &dst_file);

  snprintf(msg, sizeof(msg), "Decrypted data saved: %lu bytes", (unsigned long)total_written);
  menu_service_println(ctx, msg);

  menu_service_println(ctx, "Reading signature (64 bytes)...");
  io_result = FS_READ(src_fs, &src_file, pkg_ctx.signature, FW_PKG_SIGNATURE_SIZE);
  if (io_result != FW_PKG_SIGNATURE_SIZE)
  {
    menu_service_println(ctx, "Error: Failed to read signature!");
    FS_CLOSE(src_fs, &src_file);
    return FW_PKG_ERR_READ;
  }

  {
    static char sig_hex[33];
    for (int i = 0; i < 16; i++)
      snprintf(&sig_hex[i * 2], sizeof(sig_hex) - i * 2, "%02X", pkg_ctx.signature[i]);
    sig_hex[32] = '\0';
    snprintf(msg, sizeof(msg), "  Signature:    %s...", sig_hex);
    menu_service_println(ctx, msg);
  }

  FS_CLOSE(src_fs, &src_file);

  if (pkg_ctx.header.signature_algo == FW_PKG_SIG_ED25519 && config->ed25519_pubkey != NULL)
  {
    menu_service_println(ctx, "Verifying Ed25519 signature...");
    uint8_t sig_hash[64];
    fw_pkg_sha512_finish(&sig_state, sig_pending, sig_pending_len, sig_total_len, sig_hash);

    ret = fw_pkg_verify_signature_hash(&pkg_ctx, config, sig_hash);
    if (ret != FW_PKG_OK)
    {
      menu_service_println(ctx, "FAILED: Ed25519 signature verification FAILED!");
      menu_service_println(ctx, "Firmware may be TAMPERED or CORRUPTED!");
      return ret;
    }
    menu_service_println(ctx, "Ed25519 signature: VERIFIED");
  }
  else
  {
    menu_service_println(ctx, "Signature verification: SKIPPED (no public key)");
  }

  if (total_written > SHA256_BLOCK_SIZE)
  {
    menu_service_println(ctx, "");
    menu_service_println(ctx, "Verifying internal SHA256 checksum...");

    uint8_t stored_sha256[SHA256_BLOCK_SIZE];
    uint8_t computed_sha256[SHA256_BLOCK_SIZE];
    uint32_t firmware_size = total_written - SHA256_BLOCK_SIZE;

    snprintf(msg, sizeof(msg), "  Firmware size: %lu bytes (total %lu - hash %d)",
             (unsigned long)firmware_size, (unsigned long)total_written, SHA256_BLOCK_SIZE);
    menu_service_println(ctx, msg);

