Lingjia007/STM32F407_Bootloader/IAP/menu.c
    fs_err = FS_OPEN(dst_fs, &dst_file, dst_path, FS_MODE_READ);
    if (fs_err != FS_STATUS_OK)
    {
      menu_service_println(ctx, "Error: Cannot reopen output file for SHA256 check!");
      return FW_PKG_ERR_READ;
    }

    sha256_ctx_t sha256_ctx;
    sha256_init(&sha256_ctx);

    uint32_t firmware_remaining = firmware_size;
    while (firmware_remaining > 0)
    {
      uint32_t to_read = FW_PKG_DECRYPT_BUF_SIZE;
      if (firmware_remaining < to_read)
        to_read = firmware_remaining;

      io_result = FS_READ(dst_fs, &dst_file, process_buf, to_read);
      if (io_result <= 0)
        break;

      sha256_update(&sha256_ctx, process_buf, (size_t)io_result);
      firmware_remaining -= (uint32_t)io_result;
    }

    if (firmware_remaining != 0)
    {
      menu_service_println(ctx, "Error: Failed to read firmware for SHA256 check!");
      FS_CLOSE(dst_fs, &dst_file);
      return FW_PKG_ERR_READ;
    }

    sha256_final(&sha256_ctx, computed_sha256);

    io_result = FS_READ(dst_fs, &dst_file, stored_sha256, SHA256_BLOCK_SIZE);
    FS_CLOSE(dst_fs, &dst_file);

    if (io_result != SHA256_BLOCK_SIZE)
    {
      menu_service_println(ctx, "Error: Failed to read stored SHA256!");
      return FW_PKG_ERR_READ;
    }

    {
      static char hex_buf[65];
      for (int i = 0; i < 32; i++)
        snprintf(&hex_buf[i * 2], sizeof(hex_buf) - i * 2, "%02X", computed_sha256[i]);
      hex_buf[64] = '\0';
      snprintf(msg, sizeof(msg), "  Computed SHA256: %s", hex_buf);
      menu_service_println(ctx, msg);
    }

    {
      static char hex_buf[65];
      for (int i = 0; i < 32; i++)
        snprintf(&hex_buf[i * 2], sizeof(hex_buf) - i * 2, "%02X", stored_sha256[i]);
      hex_buf[64] = '\0';
      snprintf(msg, sizeof(msg), "  Stored SHA256:   %s", hex_buf);
      menu_service_println(ctx, msg);
    }

    if (memcmp(computed_sha256, stored_sha256, SHA256_BLOCK_SIZE) == 0)
    {
      menu_service_println(ctx, "Internal SHA256: VERIFIED");
    }
    else
    {
      menu_service_println(ctx, "FAILED: Internal SHA256 mismatch!");
      menu_service_println(ctx, "Decrypted data may be CORRUPTED!");
      return FW_PKG_ERR_DECRYPT;
    }
  }
  else
  {
    snprintf(msg, sizeof(msg), "Decrypted data too small for SHA256 check (%lu bytes)", (unsigned long)total_written);
    menu_service_println(ctx, msg);
  }

  menu_service_println(ctx, "");
  menu_service_println(ctx, "======== Summary ========");
  snprintf(msg, sizeof(msg), "  Firmware:     v%u.%u.%u",
           pkg_ctx.header.firmware_major, pkg_ctx.header.firmware_minor, pkg_ctx.header.firmware_patch);
  menu_service_println(ctx, msg);
  snprintf(msg, sizeof(msg), "  Ciphertext:   %lu bytes", (unsigned long)pkg_ctx.ciphertext_size);
  menu_service_println(ctx, msg);
  if (total_written > SHA256_BLOCK_SIZE)
  {
    snprintf(msg, sizeof(msg), "  Decrypted:    %lu bytes (firmware %lu + hash %d)",
             (unsigned long)total_written, (unsigned long)(total_written - SHA256_BLOCK_SIZE), SHA256_BLOCK_SIZE);
    menu_service_println(ctx, msg);
  }
  else
  {
    snprintf(msg, sizeof(msg), "  Decrypted:    %lu bytes", (unsigned long)total_written);
    menu_service_println(ctx, msg);
  }
  snprintf(msg, sizeof(msg), "  Output:       %s", dst_path);
  menu_service_println(ctx, msg);
  menu_service_println(ctx, "  HMAC:         PASSED");
  if (config->ed25519_pubkey)
    menu_service_println(ctx, "  Signature:    VERIFIED");
  else
    menu_service_println(ctx, "  Signature:    SKIPPED");
  if (total_written > SHA256_BLOCK_SIZE)
    menu_service_println(ctx, "  Int.SHA256:   VERIFIED");
  menu_service_println(ctx, "  Result:       SUCCESS");
  menu_service_println(ctx, "=========================");

  return FW_PKG_OK;
}

static void cmd_fw_pkg_sdcard(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[256];
  char range_str[16];
  FRESULT res;
  char src_path[128];
  char dst_path[128];
  char *dot_pos;

  uint8_t devkey_bytes[16];
  uint8_t uid_bytes[12];
  int j;

  menu_service_println(ctx, "");
  menu_service_println(ctx, "====== Firmware Package Parse (SD Card) ======");

  menu_service_println(ctx, "Initializing TF card...");
  res = f_mount(&SDFatFS, (TCHAR const *)SDPath, 1);
  if (res != FR_OK)
  {
    menu_service_print(ctx, "Error: SD card mount failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, res);
    menu_service_println(ctx, msg);
    return;
  }

  menu_service_println(ctx, "Scanning for .iap.bin files...");
  scan_sd_card_files();

  uint8_t iap_count = 0;
  for (i = 0; i < file_count; i++)
  {
    if (fw_pkg_is_iap_file(file_list[i]))
    {
      snprintf(msg, sizeof(msg), "  [%c] %s", index_to_sel_char(iap_count), file_list[i]);
      menu_service_println(ctx, msg);
      iap_count++;
    }
  }

  if (iap_count == 0)
  {
    menu_service_println(ctx, "No .iap.bin files found on SD card!");
    f_mount(NULL, (TCHAR const *)SDPath, 0);
    return;
  }

  build_sel_range_str(iap_count, range_str, sizeof(range_str));
  menu_service_printf(ctx, "\r\nSelect file (%s) or 'q' to abort: ", range_str);
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == 'q' || key == 'Q')
    {
      menu_service_println(ctx, "\rAborted by user.");
      f_mount(NULL, (TCHAR const *)SDPath, 0);
      return;
    }
    selected = sel_char_to_index((char)key);
    if (selected < iap_count)
      break;
  }

  uint8_t iap_idx = 0;
  for (i = 0; i < file_count; i++)
  {
    if (fw_pkg_is_iap_file(file_list[i]))
    {
      if (iap_idx == selected)
      {
        selected = i;
        break;
      }
      iap_idx++;
    }
  }

  snprintf(msg, sizeof(msg), "\rSelected: %s", file_list[selected]);
  menu_service_println(ctx, msg);

  snprintf(src_path, sizeof(src_path), "0:/%s", file_list[selected]);
  strncpy(dst_path, src_path, sizeof(dst_path) - 1);
  dst_path[sizeof(dst_path) - 1] = '\0';

  dot_pos = strstr(dst_path, FW_PKG_IAP_EXT);
  if (dot_pos == NULL)
    dot_pos = strstr(dst_path, FW_PKG_IAP_EXT_UPPER);
  if (dot_pos != NULL)
  {
    *dot_pos = '\0';
    strcat(dst_path, ".dec.bin");
  }
  else
  {
    strcat(dst_path, ".decrypted");
  }

  {
    const uint8_t *otp_ptr = (const uint8_t *)FLASH_OTP_BASE;
    memcpy(devkey_bytes, otp_ptr, 16);
  }

