Lingjia007/STM32F407_Bootloader/IAP/menu.c
  uint8_t *uid_ptr = (uint8_t *)UID_BASE;
  memcpy(uid_bytes, uid_ptr, 12);

  fw_pkg_verify_config_t verify_config = {
      .devkey = devkey_bytes,
      .devkey_len = 16,
      .uid = uid_bytes,
      .uid_len = 12,
      .ed25519_pubkey = FW_PKG_ED25519_PUBLIC_KEY,
      .ed25519_pubkey_len = 32,
      .hardware_compat = 0,
      .stored_security_counter = 0,
  };

  fw_pkg_print_verify_config(ctx, &verify_config);

  platform_fs_fatfs_register(&g_fs_fatfs, &SDFatFS, "fatfs");

  fw_pkg_err_t ret = fw_pkg_process_and_save(ctx, &g_fs_fatfs.base, src_path,
                                             &g_fs_fatfs.base, dst_path, &verify_config);

  if (ret != FW_PKG_OK)
  {
    snprintf(msg, sizeof(msg), "Firmware package parse FAILED: %s (err=%d)", fw_pkg_err_str(ret), ret);
    menu_service_println(ctx, msg);
  }

  f_mount(NULL, (TCHAR const *)SDPath, 0);
}

static void cmd_fw_pkg_spi(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[256];
  char range_str[16];
  char src_path[128];
  char dst_path[128];
  char *dot_pos;

  uint8_t devkey_bytes[16];
  uint8_t uid_bytes[12];
  int j;
  lfs_t lfs;

  menu_service_println(ctx, "");
  menu_service_println(ctx, "====== Firmware Package Parse (SPI Flash) ======");

  menu_service_println(ctx, "Initializing SPI Flash...");
  if (lfs_spi_flash_init() != 0)
  {
    menu_service_println(ctx, "Error: SPI Flash initialization failed!");
    return;
  }

  menu_service_println(ctx, "Mounting LittleFS...");
  if (lfs_spi_flash_mount(&lfs) != LFS_ERR_OK)
  {
    menu_service_println(ctx, "Error: LittleFS mount failed!");
    return;
  }

  menu_service_println(ctx, "Scanning for .iap.bin files...");
  scan_lfs_files(&lfs);

  uint8_t iap_count = 0;
  for (i = 0; i < file_count; i++)
  {
    if (fw_pkg_is_iap_file(file_list[i]))
    {
      snprintf(msg, sizeof(msg), "  [%c] %s", index_to_sel_char(iap_count), file_list[i]);
      menu_service_println(ctx, msg);
      iap_count++;
    }
  }

  if (iap_count == 0)
  {
    menu_service_println(ctx, "No .iap.bin files found on SPI Flash!");
    return;
  }

  build_sel_range_str(iap_count, range_str, sizeof(range_str));
  menu_service_printf(ctx, "\r\nSelect file (%s) or 'q' to abort: ", range_str);
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == 'q' || key == 'Q')
    {
      menu_service_println(ctx, "\rAborted by user.");
      return;
    }
    selected = sel_char_to_index((char)key);
    if (selected < iap_count)
      break;
  }

  uint8_t iap_idx = 0;
  for (i = 0; i < file_count; i++)
  {
    if (fw_pkg_is_iap_file(file_list[i]))
    {
      if (iap_idx == selected)
      {
        selected = i;
        break;
      }
      iap_idx++;
    }
  }

  snprintf(msg, sizeof(msg), "\rSelected: %s", file_list[selected]);
  menu_service_println(ctx, msg);

  snprintf(src_path, sizeof(src_path), "/%s", file_list[selected]);
  strncpy(dst_path, src_path, sizeof(dst_path) - 1);
  dst_path[sizeof(dst_path) - 1] = '\0';

  dot_pos = strstr(dst_path, FW_PKG_IAP_EXT);
  if (dot_pos == NULL)
    dot_pos = strstr(dst_path, FW_PKG_IAP_EXT_UPPER);
  if (dot_pos != NULL)
  {
    *dot_pos = '\0';
    strcat(dst_path, ".dec.bin");
  }
  else
  {
    strcat(dst_path, ".decrypted");
  }

  {
    const uint8_t *otp_ptr = (const uint8_t *)FLASH_OTP_BASE;
    memcpy(devkey_bytes, otp_ptr, 16);
  }

  uint8_t *uid_ptr = (uint8_t *)UID_BASE;
  memcpy(uid_bytes, uid_ptr, 12);

  fw_pkg_verify_config_t verify_config = {
      .devkey = devkey_bytes,
      .devkey_len = 16,
      .uid = uid_bytes,
      .uid_len = 12,
      .ed25519_pubkey = FW_PKG_ED25519_PUBLIC_KEY,
      .ed25519_pubkey_len = 32,
      .hardware_compat = 0,
      .stored_security_counter = 0,
  };

  fw_pkg_print_verify_config(ctx, &verify_config);

  platform_fs_lfs_register(&g_fs_lfs, &lfs, "lfs");

  fw_pkg_err_t ret = fw_pkg_process_and_save(ctx, &g_fs_lfs.base, src_path,
                                             &g_fs_lfs.base, dst_path, &verify_config);

  if (ret != FW_PKG_OK)
  {
    snprintf(msg, sizeof(msg), "Firmware package parse FAILED: %s (err=%d)", fw_pkg_err_str(ret), ret);
    menu_service_println(ctx, msg);
  }
}

static void cmd_secure_download_sdcard(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[256];
  char range_str[16];
  FRESULT res;
  char src_path[128];

  uint8_t devkey_bytes[16];
  uint8_t uid_bytes[12];

  menu_service_println(ctx, "");
  menu_service_println(ctx, "====== Secure Download to A/B Slot (SD Card) ======");

  menu_service_println(ctx, "Initializing TF card...");
  res = f_mount(&SDFatFS, (TCHAR const *)SDPath, 1);
  if (res != FR_OK)
  {
    menu_service_print(ctx, "Error: SD card mount failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, res);
    menu_service_println(ctx, msg);
    return;
  }

  menu_service_println(ctx, "Scanning for .iap.bin files...");
  scan_sd_card_files();

  uint8_t iap_count = 0;
  for (i = 0; i < file_count; i++)
  {
    if (fw_pkg_is_iap_file(file_list[i]))
    {
      snprintf(msg, sizeof(msg), "  [%c] %s", index_to_sel_char(iap_count), file_list[i]);
      menu_service_println(ctx, msg);
      iap_count++;
    }
  }

  if (iap_count == 0)
  {
    menu_service_println(ctx, "No .iap.bin files found on SD card!");
    f_mount(NULL, (TCHAR const *)SDPath, 0);
    return;
  }

  build_sel_range_str(iap_count, range_str, sizeof(range_str));
  menu_service_printf(ctx, "\r\nSelect file (%s) or 'q' to abort: ", range_str);
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == 'q' || key == 'Q')
    {
      menu_service_println(ctx, "\rAborted by user.");
      f_mount(NULL, (TCHAR const *)SDPath, 0);
      return;
    }
    selected = sel_char_to_index((char)key);
    if (selected < iap_count)
      break;
  }

  uint8_t iap_idx = 0;
  for (i = 0; i < file_count; i++)
  {
    if (fw_pkg_is_iap_file(file_list[i]))
    {
      if (iap_idx == selected)
      {
        selected = i;
        break;
      }
      iap_idx++;
    }
  }

  snprintf(msg, sizeof(msg), "\rSelected: %s", file_list[selected]);
  menu_service_println(ctx, msg);

