Lingjia007/STM32F407_Bootloader/IAP/menu.c
  snprintf(src_path, sizeof(src_path), "0:/%s", file_list[selected]);

  {
    const uint8_t *otp_ptr = (const uint8_t *)FLASH_OTP_BASE;
    memcpy(devkey_bytes, otp_ptr, 16);
  }

  uint8_t *uid_ptr = (uint8_t *)UID_BASE;
  memcpy(uid_bytes, uid_ptr, 12);

  fw_pkg_verify_config_t verify_config = {
      .devkey = devkey_bytes,
      .devkey_len = 16,
      .uid = uid_bytes,
      .uid_len = 12,
      .ed25519_pubkey = FW_PKG_ED25519_PUBLIC_KEY,
      .ed25519_pubkey_len = 32,
      .hardware_compat = 0,
      .stored_security_counter = 0,
  };

  fw_pkg_print_verify_config(ctx, &verify_config);

  ab_slot_t target_slot = ab_partition_get_inactive_slot();
  snprintf(msg, sizeof(msg), "Target slot: %s (0x%08lX)",
           ab_slot_name(target_slot), (unsigned long)ab_partition_get_slot_addr(target_slot));
  menu_service_println(ctx, msg);

  internal_flash_stm32_t flash_transport;
  platform_internal_flash_stm32_register(&flash_transport,
                                         ab_partition_get_slot_addr(target_slot),
                                         ab_partition_get_slot_addr(target_slot) + ab_partition_get_slot_size(target_slot) - 1,
                                         "internal_flash");

  g_fatfs_transport.fs = &SDFatFS;

  bootloader_secure_download_result_t result;
  bootloader_err_t err = bootloader_secure_download(&g_fatfs_transport.base, &flash_transport.transport_base, src_path, &verify_config, &result);

  if (err == BOOTLOADER_OK)
  {
    uint32_t fw_version = ((uint32_t)result.firmware_major << 16) |
                          ((uint32_t)result.firmware_minor << 8) |
                          (uint32_t)result.firmware_patch;
    ab_partition_update_slot_meta(target_slot, fw_version, result.security_counter, result.fw_size, result.sha256_valid ? result.sha256 : NULL);
    ab_partition_set_active_slot(target_slot);
    snprintf(msg, sizeof(msg), "Secure download to Slot %s completed!", ab_slot_name(target_slot));
    menu_service_println(ctx, msg);
    snprintf(msg, sizeof(msg), "  FW: v%u.%u.%u, Size: %lu bytes", result.firmware_major, result.firmware_minor, result.firmware_patch, (unsigned long)result.fw_size);
    menu_service_println(ctx, msg);
  }
  else
  {
    snprintf(msg, sizeof(msg), "Secure download FAILED: %s (err=%d)", bootloader_err_str(err), err);
    menu_service_println(ctx, msg);
  }

  f_mount(NULL, (TCHAR const *)SDPath, 0);
}

static void cmd_secure_download_spi(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[256];
  char range_str[16];
  char src_path[128];

  uint8_t devkey_bytes[16];
  uint8_t uid_bytes[12];
  lfs_t lfs;

  menu_service_println(ctx, "");
  menu_service_println(ctx, "====== Secure Download to A/B Slot (SPI Flash) ======");

  menu_service_println(ctx, "Initializing SPI Flash...");
  if (lfs_spi_flash_init() != 0)
  {
    menu_service_println(ctx, "Error: SPI Flash initialization failed!");
    return;
  }

  menu_service_println(ctx, "Mounting LittleFS...");
  if (lfs_spi_flash_mount(&lfs) != LFS_ERR_OK)
  {
    menu_service_println(ctx, "Error: LittleFS mount failed!");
    return;
  }

  menu_service_println(ctx, "Scanning for .iap.bin files...");
  scan_lfs_files(&lfs);

  uint8_t iap_count = 0;
  for (i = 0; i < file_count; i++)
  {
    if (fw_pkg_is_iap_file(file_list[i]))
    {
      snprintf(msg, sizeof(msg), "  [%c] %s", index_to_sel_char(iap_count), file_list[i]);
      menu_service_println(ctx, msg);
      iap_count++;
    }
  }

  if (iap_count == 0)
  {
    menu_service_println(ctx, "No .iap.bin files found on SPI Flash!");
    return;
  }

  build_sel_range_str(iap_count, range_str, sizeof(range_str));
  menu_service_printf(ctx, "\r\nSelect file (%s) or 'q' to abort: ", range_str);
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == 'q' || key == 'Q')
    {
      menu_service_println(ctx, "\rAborted by user.");
      return;
    }
    selected = sel_char_to_index((char)key);
    if (selected < iap_count)
      break;
  }

  uint8_t iap_idx = 0;
  for (i = 0; i < file_count; i++)
  {
    if (fw_pkg_is_iap_file(file_list[i]))
    {
      if (iap_idx == selected)
      {
        selected = i;
        break;
      }
      iap_idx++;
    }
  }

  snprintf(msg, sizeof(msg), "\rSelected: %s", file_list[selected]);
  menu_service_println(ctx, msg);

  snprintf(src_path, sizeof(src_path), "/%s", file_list[selected]);

  {
    const uint8_t *otp_ptr = (const uint8_t *)FLASH_OTP_BASE;
    memcpy(devkey_bytes, otp_ptr, 16);
  }

  uint8_t *uid_ptr = (uint8_t *)UID_BASE;
  memcpy(uid_bytes, uid_ptr, 12);

  fw_pkg_verify_config_t verify_config = {
      .devkey = devkey_bytes,
      .devkey_len = 16,
      .uid = uid_bytes,
      .uid_len = 12,
      .ed25519_pubkey = FW_PKG_ED25519_PUBLIC_KEY,
      .ed25519_pubkey_len = 32,
      .hardware_compat = 0,
      .stored_security_counter = 0,
  };

  fw_pkg_print_verify_config(ctx, &verify_config);

  ab_slot_t target_slot = ab_partition_get_inactive_slot();
  snprintf(msg, sizeof(msg), "Target slot: %s (0x%08lX)",
           ab_slot_name(target_slot), (unsigned long)ab_partition_get_slot_addr(target_slot));
  menu_service_println(ctx, msg);

  internal_flash_stm32_t flash_transport;
  platform_internal_flash_stm32_register(&flash_transport,
                                         ab_partition_get_slot_addr(target_slot),
                                         ab_partition_get_slot_addr(target_slot) + ab_partition_get_slot_size(target_slot) - 1,
                                         "internal_flash");

  g_lfs_transport.lfs = &lfs;

  bootloader_secure_download_result_t result;
  bootloader_err_t err = bootloader_secure_download(&g_lfs_transport.base, &flash_transport.transport_base, src_path, &verify_config, &result);

  if (err == BOOTLOADER_OK)
  {
    uint32_t fw_version = ((uint32_t)result.firmware_major << 16) |
                          ((uint32_t)result.firmware_minor << 8) |
                          (uint32_t)result.firmware_patch;
    ab_partition_update_slot_meta(target_slot, fw_version, result.security_counter, result.fw_size, result.sha256_valid ? result.sha256 : NULL);
    ab_partition_set_active_slot(target_slot);
    snprintf(msg, sizeof(msg), "Secure download to Slot %s completed!", ab_slot_name(target_slot));
    menu_service_println(ctx, msg);
    snprintf(msg, sizeof(msg), "  FW: v%u.%u.%u, Size: %lu bytes", result.firmware_major, result.firmware_minor, result.firmware_patch, (unsigned long)result.fw_size);
    menu_service_println(ctx, msg);
  }
  else
  {
    snprintf(msg, sizeof(msg), "Secure download FAILED: %s (err=%d)", bootloader_err_str(err), err);
    menu_service_println(ctx, msg);
  }
}

#endif

#if MENU_ENABLE_ESP8266_WIFI
static void Print_Current_Time(void)
{
  platform_rtc_time_t rtc_time;
  platform_rtc_date_t rtc_date;
  char msg[128];

  if (RTC_GET_TIME(&g_rtc.base, &rtc_time) != RTC_STATUS_OK)
  {
    menu_service_println(&g_menu_ctx, "Failed to get RTC time!");
    return;
  }

  if (RTC_GET_DATE(&g_rtc.base, &rtc_date) != RTC_STATUS_OK)
  {
    menu_service_println(&g_menu_ctx, "Failed to get RTC date!");
    return;
  }

  if (rtc_date.year < 2025)
  {
    menu_service_println(&g_menu_ctx, "RTC time not set (year < 2025)");
    return;
  }

  snprintf(msg, sizeof(msg), "\rCurrent Time: %04d-%02d-%02d %02d:%02d:%02d (UTC+8)",
           rtc_date.year, rtc_date.month, rtc_date.date,
           rtc_time.hours, rtc_time.minutes, rtc_time.seconds);
  menu_service_println(&g_menu_ctx, msg);

  uint32_t timestamp;
  if (RTC_GET_TIMESTAMP(&g_rtc.base, &timestamp) == RTC_STATUS_OK)
  {
    snprintf(msg, sizeof(msg), "Unix Timestamp: %lu", (unsigned long)timestamp);
    menu_service_println(&g_menu_ctx, msg);
  }
}

