Lingjia007/STM32F407_Bootloader/IAP/menu.c
static void cmd_esp8266_init(menu_ctx_t *ctx, int argc, char *argv[])
{
  char msg[128];

  menu_service_println(ctx, "Initializing ESP8266...");

  menu_service_println(ctx, "Step 1: AT test...");
  if (WIFI_AT_TEST(&g_esp8266_wifi.base) == PLATFORM_WIFI_OK)
    menu_service_println(ctx, "  AT test OK!");
  else
  {
    menu_service_println(ctx, "  AT test FAILED!");
    return;
  }

  char ip_buf[48] = {0};
  if (WIFI_GET_IP(&g_esp8266_wifi.base, ip_buf, sizeof(ip_buf)) == PLATFORM_WIFI_OK && ip_buf[0] != '\0')
  {
    snprintf(msg, sizeof(msg), "  Already connected! IP: %s", ip_buf);
    menu_service_println(ctx, msg);
    menu_service_println(ctx, "Step 2: Init OTA context...");
    esp8266_ota_init();
    menu_service_println(ctx, "ESP8266 init done!");
    return;
  }

  menu_service_println(ctx, "Step 2: Set STA mode...");
  if (WIFI_SET_MODE(&g_esp8266_wifi.base, PLATFORM_WIFI_MODE_STA) == PLATFORM_WIFI_OK)
    menu_service_println(ctx, "  STA mode OK!");
  else
  {
    menu_service_println(ctx, "  Set STA mode FAILED!");
    return;
  }

  snprintf(msg, sizeof(msg), "Step 3: Join AP %s...", ESP8266_WIFI_SSID);
  menu_service_println(ctx, msg);
  if (WIFI_JOIN_AP(&g_esp8266_wifi.base, ESP8266_WIFI_SSID, ESP8266_WIFI_PASSWORD) == PLATFORM_WIFI_OK)
  {
    menu_service_println(ctx, "  Join AP OK!");
    if (WIFI_GET_IP(&g_esp8266_wifi.base, ip_buf, sizeof(ip_buf)) == PLATFORM_WIFI_OK)
    {
      snprintf(msg, sizeof(msg), "  IP: %s", ip_buf);
      menu_service_println(ctx, msg);
    }
  }
  else
  {
    menu_service_println(ctx, "  Join AP FAILED!");
    return;
  }

  menu_service_println(ctx, "Step 4: Init OTA context...");
  esp8266_ota_init();
  menu_service_println(ctx, "ESP8266 init done!");
}

static void cmd_esp8266_at_test(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Testing AT command...");
  if (WIFI_AT_TEST(&g_esp8266_wifi.base) == PLATFORM_WIFI_OK)
    menu_service_println(ctx, "AT test OK!");
  else
    menu_service_println(ctx, "AT test FAILED!");
}

static void cmd_esp8266_tcp_connect(menu_ctx_t *ctx, int argc, char *argv[])
{
  char server_ip[64];
  char server_port[8];
  char msg[128];
  uint8_t key = 0;
  uint8_t idx = 0;

  menu_service_print(ctx, "\r\nEnter server IP: ");
  idx = 0;
  menu_service_flush(ctx);
  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      server_ip[idx] = '\0';
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        menu_service_print(ctx, "\b \b");
      }
    }
    else if (idx < sizeof(server_ip) - 1 && key >= 0x20 && key <= 0x7E)
    {
      server_ip[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(ctx, echo_ch);
    }
  }

  menu_service_print(ctx, "\r\nEnter server port: ");
  idx = 0;
  menu_service_flush(ctx);
  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      server_port[idx] = '\0';
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        menu_service_print(ctx, "\b \b");
      }
    }
    else if (idx < sizeof(server_port) - 1 && key >= '0' && key <= '9')
    {
      server_port[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(ctx, echo_ch);
    }
  }

  snprintf(msg, sizeof(msg), "\r\nConnecting to %s:%s...", server_ip, server_port);
  menu_service_println(ctx, msg);

  if (WIFI_CONNECT_TCP(&g_esp8266_wifi.base, server_ip, (uint16_t)atoi(server_port)) == PLATFORM_WIFI_OK)
    menu_service_println(ctx, "TCP connect OK!");
  else
    menu_service_println(ctx, "TCP connect FAILED!");
}

static void cmd_esp8266_transparent_enter(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Entering transparent mode...");
  if (WIFI_ENTER_TRANSPARENT(&g_esp8266_wifi.base) == PLATFORM_WIFI_OK)
  {
    menu_service_println(ctx, "Transparent mode enabled!");
    menu_service_println(ctx, "You can now send data directly.");
  }
  else
    menu_service_println(ctx, "Enter transparent mode FAILED!");
}

static void cmd_esp8266_transparent_exit(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Exiting transparent mode...");
  WIFI_EXIT_TRANSPARENT(&g_esp8266_wifi.base);
  menu_service_println(ctx, "Transparent mode exited.");
}

static void cmd_ota_target_internal(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Setting OTA target to Internal Flash...");
  esp8266_ota_set_target_internal_flash();
}

static void cmd_ota_target_sdcard(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Setting OTA target to SD Card (FATFS)...");
  esp8266_ota_set_target_sd_card();
}

static void cmd_ota_target_spi(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Setting OTA target to SPI Flash (LFS)...");
  esp8266_ota_set_target_spi_flash();
}

static void ota_menu_progress_cb(const onenet_ota_package_info_t *info, int progress)
{
  menu_service_print_progress(&g_menu_ctx, "OTA Downloading...", progress);
}

static void cmd_onenet_ota_download(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Starting OneNET OTA download...");
  esp8266_ota_set_progress_callback(ota_menu_progress_cb);
  esp8266_ota_download();
  esp8266_ota_set_progress_callback(NULL);
}

static void cmd_show_time(menu_ctx_t *ctx, int argc, char *argv[])
{
  Print_Current_Time();
}

static void cmd_mqtt_check_status(menu_ctx_t *ctx, int argc, char *argv[])
{
  char msg[256];

  menu_service_println(ctx, "Checking MQTT connection status...");
  int16_t ret = MQTT_CHECK_CONNECTED(&g_esp8266_mqtt.base, 0);
  if (ret == PLATFORM_MQTT_OK)
  {
    menu_service_println(ctx, "MQTT: Connected");
  }
  else
  {
    menu_service_println(ctx, "MQTT: Not connected");
  }
}

static void cmd_mqtt_configure(menu_ctx_t *ctx, int argc, char *argv[])
{
  platform_mqtt_user_config_t config;
  char msg[256];
  uint8_t key = 0;
  uint8_t idx = 0;
  char input_buf[256];

