Lingjia007/STM32F407_Bootloader/IAP/menu.c
  memset(&config, 0, sizeof(config));
  strncpy(config.client_id, ONENET_DEVICE_NAME, sizeof(config.client_id) - 1);
  strncpy(config.username, ONENET_PRODUCT_ID, sizeof(config.username) - 1);

  menu_service_println(ctx, "\rPress '!' to use macro defaults, or Enter to customize...");
  snprintf(msg, sizeof(msg), "Default: client=%s, user=%s", config.client_id, config.username);
  menu_service_println(ctx, msg);

  menu_service_print(ctx, "\r\nEnter Client ID (or Enter for default): ");
  idx = 0;
  menu_service_flush(ctx);
  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      input_buf[idx] = '\0';
      break;
    }
    else if (key == '!' && idx == 0)
    {
      input_buf[0] = '!';
      input_buf[1] = '\0';
      menu_service_print(ctx, "!");
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        menu_service_print(ctx, "\b \b");
      }
    }
    else if (idx < sizeof(input_buf) - 1 && key >= 0x20 && key <= 0x7E)
    {
      input_buf[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(ctx, echo_ch);
    }
  }

  if (strcmp(input_buf, "!") == 0)
  {
    menu_service_println(ctx, "\rUsing macro defaults...");
    strncpy(config.client_id, ONENET_DEVICE_NAME, sizeof(config.client_id) - 1);
    strncpy(config.username, ONENET_PRODUCT_ID, sizeof(config.username) - 1);
    strncpy(config.password, ONENET_MQTT_TOKEN, sizeof(config.password) - 1);
  }
  else
  {
    if (idx > 0)
      strncpy(config.client_id, input_buf, sizeof(config.client_id) - 1);

    menu_service_print(ctx, "\r\nEnter Username (Product ID): ");
    idx = 0;
    menu_service_flush(ctx);
    while (1)
    {
      menu_service_getchar(ctx, &key, RX_TIMEOUT);
      if (key == '\r' || key == '\n')
      {
        input_buf[idx] = '\0';
        break;
      }
      else if (key == 0x08 || key == 0x7F)
      {
        if (idx > 0)
        {
          idx--;
          menu_service_print(ctx, "\b \b");
        }
      }
      else if (idx < sizeof(input_buf) - 1 && key >= 0x20 && key <= 0x7E)
      {
        input_buf[idx++] = key;
        char echo_ch[2] = {(char)key, '\0'};
        menu_service_print(ctx, echo_ch);
      }
    }
    if (idx > 0)
      strncpy(config.username, input_buf, sizeof(config.username) - 1);

    menu_service_print(ctx, "\r\nEnter Password (Token): ");
    idx = 0;
    menu_service_flush(ctx);
    while (1)
    {
      menu_service_getchar(ctx, &key, RX_TIMEOUT);
      if (key == '\r' || key == '\n')
      {
        input_buf[idx] = '\0';
        break;
      }
      else if (key == 0x08 || key == 0x7F)
      {
        if (idx > 0)
        {
          idx--;
          menu_service_print(ctx, "\b \b");
        }
      }
      else if (idx < sizeof(input_buf) - 1 && key >= 0x20 && key <= 0x7E)
      {
        input_buf[idx++] = key;
        char echo_ch[2] = {(char)key, '\0'};
        menu_service_print(ctx, echo_ch);
      }
    }
    if (idx > 0)
      strncpy(config.password, input_buf, sizeof(config.password) - 1);
  }

  snprintf(msg, sizeof(msg), "\rConfiguring MQTT user: client=%s, user=%s", config.client_id, config.username);
  menu_service_println(ctx, msg);

  if (MQTT_USERCFG(&g_esp8266_mqtt.base, 0, &config) == PLATFORM_MQTT_OK)
    menu_service_println(ctx, "MQTT user config OK!");
  else
    menu_service_println(ctx, "MQTT user config FAILED!");
}

static void cmd_mqtt_connect(menu_ctx_t *ctx, int argc, char *argv[])
{
  char msg[256];
  char host[64] = ONENET_MQTT_HOST;
  uint16_t port = ONENET_MQTT_PORT;
  uint8_t key = 0;
  uint8_t idx = 0;
  char input_buf[128];

  menu_service_println(ctx, "Checking if already connected...");
  int16_t ret = MQTT_CHECK_CONNECTED(&g_esp8266_mqtt.base, 0);
  if (ret == PLATFORM_MQTT_OK)
  {
    menu_service_println(ctx, "MQTT: Already connected!");
    return;
  }

  menu_service_println(ctx, "Connecting to MQTT server...");
  snprintf(msg, sizeof(msg), "\r\nEnter MQTT server host (default: %s): ", host);
  menu_service_print(ctx, msg);
  idx = 0;
  menu_service_flush(ctx);
  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      input_buf[idx] = '\0';
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        menu_service_print(ctx, "\b \b");
      }
    }
    else if (idx < sizeof(input_buf) - 1 && key >= 0x20 && key <= 0x7E)
    {
      input_buf[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(ctx, echo_ch);
    }
  }
  if (idx > 0)
    strncpy(host, input_buf, sizeof(host) - 1);

  if (MQTT_CONNECT(&g_esp8266_mqtt.base, 0, host, port, 1) == PLATFORM_MQTT_OK)
    menu_service_println(ctx, "MQTT connect OK!");
  else
    menu_service_println(ctx, "MQTT connect FAILED!");
}

static void cmd_mqtt_subscribe(menu_ctx_t *ctx, int argc, char *argv[])
{
  char msg[256];
  char topic[128];

  menu_service_println(ctx, "Subscribing to property topics...");

  snprintf(topic, sizeof(topic), "$sys/%s/%s/thing/property/post/reply", ONENET_PRODUCT_ID, ONENET_DEVICE_NAME);
  snprintf(msg, sizeof(msg), "Subscribing: %s", topic);
  menu_service_println(ctx, msg);
  MQTT_SUBSCRIBE(&g_esp8266_mqtt.base, 0, topic, 1);

  snprintf(topic, sizeof(topic), "$sys/%s/%s/ota/inform", ONENET_PRODUCT_ID, ONENET_DEVICE_NAME);
  snprintf(msg, sizeof(msg), "Subscribing: %s", topic);
  menu_service_println(ctx, msg);
  MQTT_SUBSCRIBE(&g_esp8266_mqtt.base, 0, topic, 1);

  snprintf(topic, sizeof(topic), "$sys/%s/%s/thing/property/desired/get/reply", ONENET_PRODUCT_ID, ONENET_DEVICE_NAME);
  snprintf(msg, sizeof(msg), "Subscribing: %s", topic);
  menu_service_println(ctx, msg);
  MQTT_SUBSCRIBE(&g_esp8266_mqtt.base, 0, topic, 1);

  snprintf(topic, sizeof(topic), "$sys/%s/%s/thing/property/desired/delete/reply", ONENET_PRODUCT_ID, ONENET_DEVICE_NAME);
  snprintf(msg, sizeof(msg), "Subscribing: %s", topic);
  menu_service_println(ctx, msg);
  MQTT_SUBSCRIBE(&g_esp8266_mqtt.base, 0, topic, 1);

  snprintf(topic, sizeof(topic), "$sys/%s/%s/thing/property/get", ONENET_PRODUCT_ID, ONENET_DEVICE_NAME);
  snprintf(msg, sizeof(msg), "Subscribing: %s", topic);
  menu_service_println(ctx, msg);
  MQTT_SUBSCRIBE(&g_esp8266_mqtt.base, 0, topic, 1);
}

static void cmd_mqtt_publish(menu_ctx_t *ctx, int argc, char *argv[])
{
  platform_mqtt_property_t prop;
  char msg[256];
  char msg_id[32] = "007";
  char type_buf[4];
  char value_buf[64];
  uint8_t key = 0;
  uint8_t idx = 0;

  memset(&prop, 0, sizeof(prop));

  menu_service_print(ctx, "\r\nEnter message ID (default: 007): ");
  idx = 0;
  menu_service_flush(ctx);
  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      msg_id[idx] = '\0';
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        menu_service_print(ctx, "\b \b");
      }
    }
    else if (idx < sizeof(msg_id) - 1 && key >= 0x20 && key <= 0x7E)
    {
      msg_id[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(ctx, echo_ch);
    }
  }
  if (idx == 0)
    strcpy(msg_id, "007");

  menu_service_print(ctx, "\r\nEnter property key (e.g. BSP_LED): ");
  idx = 0;
  menu_service_flush(ctx);
  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      prop.key[idx] = '\0';
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        menu_service_print(ctx, "\b \b");
      }
    }
    else if (idx < sizeof(prop.key) - 1 && key >= 0x20 && key <= 0x7E)
    {
      prop.key[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(ctx, echo_ch);
    }
  }

  menu_service_print(ctx, "\r\nEnter value type (0=int, 1=float, 2=bool, 3=string): ");
  idx = 0;
  menu_service_flush(ctx);
  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      type_buf[idx] = '\0';
      break;
    }
    else if (key >= '0' && key <= '9' && idx < sizeof(type_buf) - 1)
    {
      type_buf[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(ctx, echo_ch);
    }
  }
  prop.value_type = (uint8_t)atoi(type_buf);

  menu_service_print(ctx, "\r\nEnter value: ");
  idx = 0;
  menu_service_flush(ctx);
  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      value_buf[idx] = '\0';
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        menu_service_print(ctx, "\b \b");
      }
    }
    else if (idx < sizeof(value_buf) - 1 && key >= 0x20 && key <= 0x7E)
    {
      value_buf[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(ctx, echo_ch);
    }
  }

