Lingjia007/STM32F407_Bootloader/IAP/menu.c
  if (prop.value_type == PLATFORM_MQTT_VALUE_FLOAT)
    prop.value_float = atof(value_buf);
  else if (prop.value_type == PLATFORM_MQTT_VALUE_BOOL)
    prop.value_int = (strcmp(value_buf, "true") == 0 || strcmp(value_buf, "1") == 0) ? 1 : 0;
  else if (prop.value_type == PLATFORM_MQTT_VALUE_STRING)
    strncpy(prop.id, value_buf, sizeof(prop.id) - 1);
  else
    prop.value_int = atoi(value_buf);

  snprintf(msg, sizeof(msg), "\rPublishing: %s = %s (type=%d, id=%s)", prop.key, value_buf, prop.value_type, msg_id);
  menu_service_println(ctx, msg);

  if (MQTT_PUBLISH_PROPERTY(&g_esp8266_mqtt.base, 0, ONENET_PRODUCT_ID, ONENET_DEVICE_NAME, &prop, 1, msg_id) == PLATFORM_MQTT_OK)
    menu_service_println(ctx, "Publish OK!");
  else
    menu_service_println(ctx, "Publish FAILED!");
}

static void cmd_mqtt_listen(menu_ctx_t *ctx, int argc, char *argv[])
{
  char msg[256];
  char recv_topic[128];
  char recv_payload[512];
  char recv_msg_id[32];
  uint8_t exit_q_count = 0;
  uint32_t exit_q_timer = 0;

  menu_service_println(ctx, "Listening for property set commands...");
  menu_service_println(ctx, "Press 'q' 3 times within 1 second to exit");

  while (1)
  {
    if ((huart4.Instance->SR & UART_FLAG_RXNE) != RESET)
    {
      uint8_t rx_char = (uint8_t)(huart4.Instance->DR & 0xFF);
      if (rx_char == 'q')
      {
        if (exit_q_count == 0 || (HAL_GetTick() - exit_q_timer) < 1000)
        {
          exit_q_count++;
          exit_q_timer = HAL_GetTick();
          if (exit_q_count >= 3)
          {
            menu_service_println(ctx, "Exiting listen mode...");
            break;
          }
        }
        else
        {
          exit_q_count = 1;
          exit_q_timer = HAL_GetTick();
        }
      }
      else
        exit_q_count = 0;
    }

    char recv_topic[PLATFORM_MQTT_MAX_TOPIC_LEN];
    char recv_payload[PLATFORM_MQTT_MAX_PAYLOAD_LEN];
    char recv_msg_id[32];
    platform_mqtt_property_t recv_props[8];
    uint8_t recv_prop_count = 0;

    int16_t recv_ret = MQTT_CHECK_PROPERTY_SET_RECV(&g_esp8266_mqtt.base, recv_topic, recv_payload, sizeof(recv_payload), recv_msg_id);
    if (recv_ret == PLATFORM_MQTT_OK)
    {
      snprintf(msg, sizeof(msg), "\rReceived: topic=%s", recv_topic);
      menu_service_println(ctx, msg);
      snprintf(msg, sizeof(msg), "Payload: %s", recv_payload);
      menu_service_println(ctx, msg);
      snprintf(msg, sizeof(msg), "Message ID: %s", recv_msg_id);
      menu_service_println(ctx, msg);

      if (strstr(recv_topic, "/thing/property/set") != NULL)
      {
        menu_service_println(ctx, "Auto replying to property set...");
        if (MQTT_PUBLISH_SET_REPLY(&g_esp8266_mqtt.base, 0, ONENET_PRODUCT_ID, ONENET_DEVICE_NAME, recv_msg_id, 200, "user_succ") == PLATFORM_MQTT_OK)
          menu_service_println(ctx, "Reply sent successfully!");
        else
          menu_service_println(ctx, "Reply FAILED!");
      }
    }
    HAL_Delay(10);
  }
}

static void cmd_mqtt_disconnect(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Disconnecting MQTT...");
  if (MQTT_DISCONNECT(&g_esp8266_mqtt.base, 0) == PLATFORM_MQTT_OK)
    menu_service_println(ctx, "MQTT disconnected!");
  else
    menu_service_println(ctx, "Disconnect FAILED!");
}

static void cmd_mqtt_sync_time(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Syncing time from server...");
  if (esp8266_ota_sync_time())
  {
    menu_service_println(ctx, "Time sync success!");
    Print_Current_Time();
  }
  else
    menu_service_println(ctx, "Time sync FAILED!");
}

static void cmd_mqtt_publish_rtc(menu_ctx_t *ctx, int argc, char *argv[])
{
  char msg[256];
  char rtc_time_str[64];
  uint32_t publish_count = 0;
  uint8_t key = 0;

  menu_service_println(ctx, "Publishing RTC time every 1s...");
  menu_service_println(ctx, "Press 'q' or 'Q' to exit");

  while (1)
  {
    if (menu_service_getchar(ctx, &key, 10) > 0)
    {
      if (key == 'q' || key == 'Q')
      {
        menu_service_println(ctx, "Exiting RTC time publish mode...");
        snprintf(msg, sizeof(msg), "Total published: %lu times", (unsigned long)publish_count);
        menu_service_println(ctx, msg);
        break;
      }
    }

    platform_rtc_time_t rtc_time;
    platform_rtc_date_t rtc_date;

    if (RTC_GET_TIME(&g_rtc.base, &rtc_time) == RTC_STATUS_OK &&
        RTC_GET_DATE(&g_rtc.base, &rtc_date) == RTC_STATUS_OK)
    {
      snprintf(rtc_time_str, sizeof(rtc_time_str), "%04d-%02d-%02d %02d:%02d:%02d",
               rtc_date.year, rtc_date.month, rtc_date.date,
               rtc_time.hours, rtc_time.minutes, rtc_time.seconds);

      platform_mqtt_property_t prop;
      memset(&prop, 0, sizeof(prop));
      strncpy(prop.key, "RTC_TIME", sizeof(prop.key) - 1);
      strncpy(prop.id, rtc_time_str, sizeof(prop.id) - 1);
      prop.value_type = PLATFORM_MQTT_VALUE_STRING;

      if (MQTT_PUBLISH_PROPERTY(&g_esp8266_mqtt.base, 0, ONENET_PRODUCT_ID, ONENET_DEVICE_NAME, &prop, 1, "007") == PLATFORM_MQTT_OK)
      {
        publish_count++;
        snprintf(msg, sizeof(msg), "Published %lu times: %s", (unsigned long)publish_count, rtc_time_str);
        menu_service_println(ctx, msg);
      }
    }

    HAL_Delay(1000);
  }
}
#endif

#if MENU_ENABLE_AES_DECRYPT
static void cmd_decrypt_sdcard(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[256];
  char range_str[16];
  FRESULT res;
  int decrypt_result;
  char src_path[128];
  char dst_path[128];
  char *dot_pos;
  aes_decrypt_config_t decrypt_config = {
      .key = {0x8f, 0x8b, 0x6e, 0xcb, 0x07, 0x78, 0xa9, 0xb7,
              0x10, 0x97, 0x94, 0xb6, 0xe2, 0x31, 0xcd, 0xf3,
              0xc3, 0x40, 0x2e, 0x1d, 0x4f, 0x2a, 0xa3, 0x14,
              0xe0, 0x56, 0x60, 0x16, 0xac, 0xe4, 0x5c, 0xe0},
      .iv = {0xc1, 0xb7, 0x95, 0x2d, 0x38, 0xe6, 0x0e, 0xbd,
             0x33, 0x30, 0x6d, 0xdf, 0x49, 0x2b, 0x7a, 0x58}};

  menu_service_println(ctx, "Initializing TF card...");
  res = f_mount(&SDFatFS, (TCHAR const *)SDPath, 1);
  if (res != FR_OK)
  {
    menu_service_print(ctx, "Error: SD card mount failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, res);
    menu_service_println(ctx, msg);
    return;
  }

  menu_service_println(ctx, "Scanning for .bin.aes files...\r");
  scan_sd_card_files();

  uint8_t aes_file_count = 0;
  for (i = 0; i < file_count; i++)
  {
    size_t len = strlen(file_list[i]);
    if (len >= 8)
    {
      const char *ext = file_list[i] + len - 8;
      if (strcmp(ext, ".bin.aes") == 0 || strcmp(ext, ".BIN.AES") == 0)
      {
        snprintf(msg, sizeof(msg), "  [%c] %s", index_to_sel_char(aes_file_count), file_list[i]);
        menu_service_println(ctx, msg);
        aes_file_count++;
      }
    }
  }

