Lingjia007/STM32F407_Bootloader/IAP/menu.c
  if (aes_file_count == 0)
  {
    menu_service_println(ctx, "No .bin.aes files found on SD card!");
    f_mount(NULL, (TCHAR const *)SDPath, 0);
    return;
  }

  build_sel_range_str(aes_file_count, range_str, sizeof(range_str));
  menu_service_printf(ctx, "\r\nSelect file to decrypt (%s) or 'q' to abort: ", range_str);
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == 'q' || key == 'Q')
    {
      menu_service_println(ctx, "\rAborted by user.");
      f_mount(NULL, (TCHAR const *)SDPath, 0);
      return;
    }
    selected = sel_char_to_index((char)key);
    if (selected < aes_file_count)
      break;
  }

  uint8_t aes_idx = 0;
  for (i = 0; i < file_count; i++)
  {
    size_t len = strlen(file_list[i]);
    if (len >= 8)
    {
      const char *ext = file_list[i] + len - 8;
      if (strcmp(ext, ".bin.aes") == 0 || strcmp(ext, ".BIN.AES") == 0)
      {
        if (aes_idx == selected)
        {
          selected = i;
          break;
        }
        aes_idx++;
      }
    }
  }

  snprintf(msg, sizeof(msg), "\rSelected: %s", file_list[selected]);
  menu_service_println(ctx, msg);

  snprintf(src_path, sizeof(src_path), "0:/%s", file_list[selected]);
  strncpy(dst_path, src_path, sizeof(dst_path) - 1);
  dst_path[sizeof(dst_path) - 1] = '\0';

  dot_pos = strstr(dst_path, ".bin.aes");
  if (dot_pos == NULL)
    dot_pos = strstr(dst_path, ".BIN.AES");
  if (dot_pos != NULL)
  {
    *dot_pos = '\0';
    strcat(dst_path, ".bin");
  }
  else
    strcat(dst_path, ".decrypted");

  snprintf(msg, sizeof(msg), "Output file: %s", dst_path);
  menu_service_println(ctx, msg);
  menu_service_println(ctx, "Starting decryption...");

  platform_fs_fatfs_register(&g_fs_fatfs, &SDFatFS, "fatfs");
  decrypt_result = aes_decrypt_file(&g_fs_fatfs.base, src_path, dst_path, &decrypt_config);

  if (decrypt_result > 0)
  {
    menu_service_println(ctx, "Decryption completed successfully!");
    snprintf(msg, sizeof(msg), "Decrypted size: %d bytes", decrypt_result);
    menu_service_println(ctx, msg);
    menu_service_println(ctx, "Output file saved to SD card.");
  }
  else
  {
    menu_service_print(ctx, "Decryption failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, (uint32_t)(-decrypt_result));
    menu_service_println(ctx, msg);
  }

  f_mount(NULL, (TCHAR const *)SDPath, 0);
}

static void cmd_decrypt_download_sdcard(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[256];
  char range_str[16];
  FRESULT res;
  int decrypt_result;
  char src_path[128];
  aes_decrypt_config_t decrypt_config = {
      .key = {0x8f, 0x8b, 0x6e, 0xcb, 0x07, 0x78, 0xa9, 0xb7,
              0x10, 0x97, 0x94, 0xb6, 0xe2, 0x31, 0xcd, 0xf3,
              0xc3, 0x40, 0x2e, 0x1d, 0x4f, 0x2a, 0xa3, 0x14,
              0xe0, 0x56, 0x60, 0x16, 0xac, 0xe4, 0x5c, 0xe0},
      .iv = {0xc1, 0xb7, 0x95, 0x2d, 0x38, 0xe6, 0x0e, 0xbd,
             0x33, 0x30, 0x6d, 0xdf, 0x49, 0x2b, 0x7a, 0x58}};

  menu_service_println(ctx, "Initializing TF card...");
  res = f_mount(&SDFatFS, (TCHAR const *)SDPath, 1);
  if (res != FR_OK)
  {
    menu_service_print(ctx, "Error: SD card mount failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, res);
    menu_service_println(ctx, msg);
    return;
  }

  menu_service_println(ctx, "Scanning for .bin.aes files...\r");
  scan_sd_card_files();

  uint8_t aes_file_count = 0;
  for (i = 0; i < file_count; i++)
  {
    size_t len = strlen(file_list[i]);
    if (len >= 8)
    {
      const char *ext = file_list[i] + len - 8;
      if (strcmp(ext, ".bin.aes") == 0 || strcmp(ext, ".BIN.AES") == 0)
      {
        snprintf(msg, sizeof(msg), "  [%c] %s", index_to_sel_char(aes_file_count), file_list[i]);
        menu_service_println(ctx, msg);
        aes_file_count++;
      }
    }
  }

  if (aes_file_count == 0)
  {
    menu_service_println(ctx, "No .bin.aes files found on SD card!");
    f_mount(NULL, (TCHAR const *)SDPath, 0);
    return;
  }

  build_sel_range_str(aes_file_count, range_str, sizeof(range_str));
  menu_service_printf(ctx, "\r\nSelect file to decrypt and download (%s) or 'q' to abort: ", range_str);
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == 'q' || key == 'Q')
    {
      menu_service_println(ctx, "\rAborted by user.");
      f_mount(NULL, (TCHAR const *)SDPath, 0);
      return;
    }
    selected = sel_char_to_index((char)key);
    if (selected < aes_file_count)
      break;
  }

  uint8_t aes_idx = 0;
  for (i = 0; i < file_count; i++)
  {
    size_t len = strlen(file_list[i]);
    if (len >= 8)
    {
      const char *ext = file_list[i] + len - 8;
      if (strcmp(ext, ".bin.aes") == 0 || strcmp(ext, ".BIN.AES") == 0)
      {
        if (aes_idx == selected)
        {
          selected = i;
          break;
        }
        aes_idx++;
      }
    }
  }

  snprintf(msg, sizeof(msg), "\rSelected: %s", file_list[selected]);
  menu_service_println(ctx, msg);
  snprintf(src_path, sizeof(src_path), "0:/%s", file_list[selected]);

  {
    ab_slot_t target_slot = ab_partition_get_inactive_slot();
    internal_flash_stm32_t *target_flash = (target_slot == AB_SLOT_A) ? &g_slot_a_flash : &g_slot_b_flash;

    snprintf(msg, sizeof(msg), "Decrypting to Slot %s (0x%08lX)...",
             ab_slot_name(target_slot), (unsigned long)ab_partition_get_slot_addr(target_slot));
    menu_service_println(ctx, msg);

    platform_fs_fatfs_register(&g_fs_fatfs, &SDFatFS, "fatfs");
    decrypt_result = aes_decrypt_to_flash(&g_fs_fatfs.base, src_path, &target_flash->transport_base, &decrypt_config);

    if (decrypt_result > 0)
    {
      ab_partition_update_slot_meta(target_slot, 0, 0, 0, NULL);
      ab_partition_set_active_slot(target_slot);
      snprintf(msg, sizeof(msg), "Decryption to Slot %s completed!", ab_slot_name(target_slot));
      menu_service_println(ctx, msg);
      snprintf(msg, sizeof(msg), "Written size: %d bytes", decrypt_result);
      menu_service_println(ctx, msg);
    }
    else
    {
      menu_service_print(ctx, "Decryption failed! Error code: ");
      menu_service_int2str((uint8_t *)msg, (uint32_t)(-decrypt_result));
      menu_service_println(ctx, msg);
    }
  }

  f_mount(NULL, (TCHAR const *)SDPath, 0);
}

