Lingjia007/STM32F407_Bootloader/IAP/menu.c
static void cmd_decrypt_download_spi(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[256];
  char range_str[16];
  int res;
  int decrypt_result;
  lfs_t lfs;
  aes_decrypt_config_t decrypt_config = {
      .key = {0x8f, 0x8b, 0x6e, 0xcb, 0x07, 0x78, 0xa9, 0xb7,
              0x10, 0x97, 0x94, 0xb6, 0xe2, 0x31, 0xcd, 0xf3,
              0xc3, 0x40, 0x2e, 0x1d, 0x4f, 0x2a, 0xa3, 0x14,
              0xe0, 0x56, 0x60, 0x16, 0xac, 0xe4, 0x5c, 0xe0},
      .iv = {0xc1, 0xb7, 0x95, 0x2d, 0x38, 0xe6, 0x0e, 0xbd,
             0x33, 0x30, 0x6d, 0xdf, 0x49, 0x2b, 0x7a, 0x58}};

  menu_service_println(ctx, "Initializing SPI Flash...");
  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(ctx, "Error: SPI Flash initialization failed!");
    return;
  }

  menu_service_println(ctx, "Mounting LittleFS...");
  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(ctx, "Error: LittleFS mount failed!");
    return;
  }

  menu_service_println(ctx, "Scanning for .bin.aes files...\r");
  scan_lfs_files(&lfs);

  uint8_t lfs_aes_file_count = 0;
  for (i = 0; i < file_count; i++)
  {
    size_t len = strlen(file_list[i]);
    if (len >= 8)
    {
      const char *ext = file_list[i] + len - 8;
      if (strcmp(ext, ".bin.aes") == 0 || strcmp(ext, ".BIN.AES") == 0)
      {
        snprintf(msg, sizeof(msg), "  [%c] %s", index_to_sel_char(lfs_aes_file_count), file_list[i]);
        menu_service_println(ctx, msg);
        lfs_aes_file_count++;
      }
    }
  }

  if (lfs_aes_file_count == 0)
  {
    menu_service_println(ctx, "No .bin.aes files found on SPI Flash!");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  build_sel_range_str(lfs_aes_file_count, range_str, sizeof(range_str));
  menu_service_printf(ctx, "\r\nSelect file to decrypt and download (%s) or 'q' to abort: ", range_str);
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == 'q' || key == 'Q')
    {
      menu_service_println(ctx, "\rAborted by user.");
      lfs_spi_flash_unmount(&lfs);
      return;
    }
    selected = sel_char_to_index((char)key);
    if (selected < lfs_aes_file_count)
      break;
  }

  uint8_t lfs_aes_idx = 0;
  for (i = 0; i < file_count; i++)
  {
    size_t len = strlen(file_list[i]);
    if (len >= 8)
    {
      const char *ext = file_list[i] + len - 8;
      if (strcmp(ext, ".bin.aes") == 0 || strcmp(ext, ".BIN.AES") == 0)
      {
        if (lfs_aes_idx == selected)
        {
          selected = i;
          break;
        }
        lfs_aes_idx++;
      }
    }
  }

  snprintf(msg, sizeof(msg), "\rSelected: %s", file_list[selected]);
  menu_service_println(ctx, msg);

  {
    ab_slot_t target_slot = ab_partition_get_inactive_slot();
    internal_flash_stm32_t *target_flash = (target_slot == AB_SLOT_A) ? &g_slot_a_flash : &g_slot_b_flash;

    snprintf(msg, sizeof(msg), "Decrypting to Slot %s (0x%08lX)...",
             ab_slot_name(target_slot), (unsigned long)ab_partition_get_slot_addr(target_slot));
    menu_service_println(ctx, msg);

    platform_fs_lfs_register(&g_fs_lfs, &lfs, "lfs");
    decrypt_result = aes_decrypt_to_flash(&g_fs_lfs.base, file_list[selected], &target_flash->transport_base, &decrypt_config);

    if (decrypt_result > 0)
    {
      ab_partition_update_slot_meta(target_slot, 0, 0, 0, NULL);
      ab_partition_set_active_slot(target_slot);
      snprintf(msg, sizeof(msg), "Decryption to Slot %s completed!", ab_slot_name(target_slot));
      menu_service_println(ctx, msg);
      snprintf(msg, sizeof(msg), "Written size: %d bytes", decrypt_result);
      menu_service_println(ctx, msg);
    }
    else
    {
      menu_service_print(ctx, "Decryption failed! Error code: ");
      menu_service_int2str((uint8_t *)msg, (uint32_t)(-decrypt_result));
      menu_service_println(ctx, msg);
    }
  }

  lfs_spi_flash_unmount(&lfs);
}
#endif

#if MENU_ENABLE_HPATCH
typedef struct
{
  const char *storage_name;
  const char *dir_path;
  const char *path_prefix;
  platform_fs_base_t *fs;
} hpatch_storage_ctx_t;

static void cmd_hpatch_workflow(menu_ctx_t *ctx, const hpatch_storage_ctx_t *storage)
{
  uint8_t key = 0;
  uint8_t selected_diff = 0;
  uint8_t selected_old = 0;
  uint8_t i;
  static char msg[256];
  char range_str[16];
  hpatch_err_t patch_result;
  hpatch_config_t config;
  static char diff_path[HPATCH_MAX_PATH_LEN];
  static char old_path[HPATCH_MAX_PATH_LEN];
  static char out_path[HPATCH_MAX_PATH_LEN];
  char *dot_pos;
  const char *upgrade_tag = "_HdiffUpgraded";

  menu_service_println(ctx, "Scanning for .hdiff files...\r");
  scan_fs_hdiff_files(storage->fs, storage->dir_path);

  if (hdiff_count == 0)
  {
    snprintf(msg, sizeof(msg), "No .hdiff files found on %s!", storage->storage_name);
    menu_service_println(ctx, msg);
    return;
  }

  menu_service_println(ctx, "Found .hdiff files:");
  for (i = 0; i < hdiff_count; i++)
  {
    snprintf(msg, sizeof(msg), "  [%c] %s", index_to_sel_char(i), hdiff_list[i]);
    menu_service_println(ctx, msg);
  }

  build_sel_range_str(hdiff_count, range_str, sizeof(range_str));
  menu_service_printf(ctx, "\r\nSelect .hdiff file (%s) or 'q' to abort: ", range_str);
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == 'q' || key == 'Q')
    {
      menu_service_println(ctx, "\rAborted by user.");
      return;
    }
    selected_diff = sel_char_to_index((char)key);
    if (selected_diff < hdiff_count)
      break;
  }

  snprintf(msg, sizeof(msg), "\rSelected: %s", hdiff_list[selected_diff]);
  menu_service_println(ctx, msg);
  menu_service_println(ctx, "Scanning for .bin firmware files...\r");
  scan_fs_files_filter(storage->fs, storage->dir_path, 1);

  if (file_count == 0)
  {
    snprintf(msg, sizeof(msg), "No .bin files found on %s!", storage->storage_name);
    menu_service_println(ctx, msg);
    return;
  }

  menu_service_println(ctx, "Found firmware files:");
  for (i = 0; i < file_count; i++)
  {
    snprintf(msg, sizeof(msg), "  [%c] %s", index_to_sel_char(i), file_list[i]);
    menu_service_println(ctx, msg);
  }

  build_sel_range_str(file_count, range_str, sizeof(range_str));
  menu_service_printf(ctx, "\r\nSelect old firmware file to update (%s) or 'q' to abort: ", range_str);
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == 'q' || key == 'Q')
    {
      menu_service_println(ctx, "\rAborted by user.");
      return;
    }
    selected_old = sel_char_to_index((char)key);
    if (selected_old < file_count)
      break;
  }

