Lingjia007/STM32F407_Bootloader/IAP/menu.c
  snprintf(msg, sizeof(msg), "\rSelected: %s", file_list[selected_old]);
  menu_service_println(ctx, msg);

  if (storage->path_prefix[0] != '\0')
  {
    snprintf(diff_path, sizeof(diff_path), "%s%s", storage->path_prefix, hdiff_list[selected_diff]);
    snprintf(old_path, sizeof(old_path), "%s%s", storage->path_prefix, file_list[selected_old]);
  }
  else
  {
    strncpy(diff_path, hdiff_list[selected_diff], sizeof(diff_path) - 1);
    diff_path[sizeof(diff_path) - 1] = '\0';
    strncpy(old_path, file_list[selected_old], sizeof(old_path) - 1);
    old_path[sizeof(old_path) - 1] = '\0';
  }

  strncpy(out_path, old_path, sizeof(out_path) - 1);
  out_path[sizeof(out_path) - 1] = '\0';

  dot_pos = strrchr(out_path, '.');
  if (dot_pos != NULL)
  {
    size_t base_len = dot_pos - out_path;
    if (base_len + strlen(upgrade_tag) + 4 < sizeof(out_path))
      snprintf(dot_pos, sizeof(out_path) - base_len, "%s.bin", upgrade_tag);
    else
      strncat(out_path, upgrade_tag, sizeof(out_path) - strlen(out_path) - 1);
  }
  else
  {
    strncat(out_path, upgrade_tag, sizeof(out_path) - strlen(out_path) - 1);
    strncat(out_path, ".bin", sizeof(out_path) - strlen(out_path) - 1);
  }

  config.fs = storage->fs;
  config.diff_path = diff_path;
  config.old_path = old_path;
  config.out_path = out_path;

  snprintf(msg, sizeof(msg), "\rDiff file: %s", config.diff_path);
  menu_service_println(ctx, msg);
  snprintf(msg, sizeof(msg), "Old firmware: %s", config.old_path);
  menu_service_println(ctx, msg);
  snprintf(msg, sizeof(msg), "Output file: %s", config.out_path);
  menu_service_println(ctx, msg);
  menu_service_println(ctx, "Starting HPatch differential upgrade...");

  patch_result = hpatch_upgrade(&config);

  if (patch_result == HPATCH_OK)
  {
    menu_service_println(ctx, "HPatch upgrade completed successfully!");
    snprintf(msg, sizeof(msg), "Upgraded firmware saved to %s.", storage->storage_name);
    menu_service_println(ctx, msg);
    snprintf(msg, sizeof(msg), "Output: %s", config.out_path);
    menu_service_println(ctx, msg);
  }
  else
  {
    menu_service_print(ctx, "HPatch upgrade failed! Error: ");
    menu_service_println(ctx, hpatch_err_to_string(patch_result));
  }
}

static void cmd_hpatch_sdcard(menu_ctx_t *ctx, int argc, char *argv[])
{
  FRESULT res;
  char msg[256];
  hpatch_storage_ctx_t storage = {"SD card", "0:/", "0:/", NULL};

  menu_service_println(ctx, "Initializing TF card...");
  res = f_mount(&SDFatFS, (TCHAR const *)SDPath, 1);
  if (res != FR_OK)
  {
    menu_service_print(ctx, "Error: SD card mount failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, res);
    menu_service_println(ctx, msg);
    return;
  }

  platform_fs_fatfs_register(&g_fs_fatfs, &SDFatFS, "fatfs");
  storage.fs = &g_fs_fatfs.base;

  cmd_hpatch_workflow(ctx, &storage);

  f_mount(NULL, (TCHAR const *)SDPath, 0);
}

static void cmd_hpatch_spi(menu_ctx_t *ctx, int argc, char *argv[])
{
  int res;
  lfs_t lfs;
  hpatch_storage_ctx_t storage = {"SPI Flash", "/", "", NULL};

  menu_service_println(ctx, "Initializing SPI Flash...");
  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(ctx, "Error: SPI Flash initialization failed!");
    return;
  }

  menu_service_println(ctx, "Mounting LittleFS...");
  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(ctx, "Error: LittleFS mount failed!");
    return;
  }

  platform_fs_lfs_register(&g_fs_lfs, &lfs, "lfs");
  storage.fs = &g_fs_lfs.base;

  cmd_hpatch_workflow(ctx, &storage);

  lfs_spi_flash_unmount(&lfs);
}
#endif

#if MENU_ENABLE_ED25519_VERIFY
typedef struct
{
  const char *storage_name;
  const char *dir_path;
  const char *path_prefix;
  platform_fs_base_t *fs;
} ed25519_storage_ctx_t;

static void cmd_ed25519_verify_workflow(menu_ctx_t *ctx, const ed25519_storage_ctx_t *storage)
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  static char msg[256];
  char range_str[16];
  int verify_result;
  static char data_path[128];
  static char sig_path[128];
  ed25519_verify_config_t verify_config = {
      .public_key = {0x59, 0x89, 0x1c, 0x71, 0x9e, 0xd1, 0xa1, 0x95, 0x7b, 0x6f, 0x1e, 0x77, 0x6e, 0x1f, 0xf0, 0xf6, 0xff, 0xf3, 0xc3, 0x60, 0x62, 0xe7, 0xcc, 0x22, 0x8c, 0xa1, 0x76, 0x88, 0x0e, 0xe7, 0x2b, 0xde}};

  menu_service_println(ctx, "Scanning for .bin files...\r");
  scan_fs_files_filter(storage->fs, storage->dir_path, 1);

  if (file_count == 0)
  {
    snprintf(msg, sizeof(msg), "No .bin files found on %s!", storage->storage_name);
    menu_service_println(ctx, msg);
    return;
  }

  menu_service_println(ctx, "Found firmware files:");
  for (i = 0; i < file_count; i++)
  {
    snprintf(msg, sizeof(msg), "  [%c] %s", index_to_sel_char(i), file_list[i]);
    menu_service_println(ctx, msg);
  }

  build_sel_range_str(file_count, range_str, sizeof(range_str));
  menu_service_printf(ctx, "\r\nSelect firmware file to verify (%s) or 'q' to abort: ", range_str);
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == 'q' || key == 'Q')
    {
      menu_service_println(ctx, "\rAborted by user.");
      return;
    }
    selected = sel_char_to_index((char)key);
    if (selected < file_count)
      break;
  }

  snprintf(msg, sizeof(msg), "\rSelected: %s", file_list[selected]);
  menu_service_println(ctx, msg);

  if (storage->path_prefix[0] != '\0')
  {
    snprintf(data_path, sizeof(data_path), "%s%s", storage->path_prefix, file_list[selected]);
  }
  else
  {
    strncpy(data_path, file_list[selected], sizeof(data_path) - 1);
    data_path[sizeof(data_path) - 1] = '\0';
  }

  strncpy(sig_path, data_path, sizeof(sig_path) - 1);
  sig_path[sizeof(sig_path) - 1] = '\0';

  char *dot_pos = strrchr(sig_path, '.');
  if (dot_pos != NULL)
    snprintf(dot_pos, sizeof(sig_path) - (dot_pos - sig_path), ".sig");
  else
    strncat(sig_path, ".sig", sizeof(sig_path) - strlen(sig_path) - 1);

  snprintf(msg, sizeof(msg), "Data file: %s", data_path);
  menu_service_println(ctx, msg);
  snprintf(msg, sizeof(msg), "Signature file: %s", sig_path);
  menu_service_println(ctx, msg);
  menu_service_println(ctx, "Starting Ed25519 signature verification...");

  verify_result = ed25519_verify_file(storage->fs, data_path, sig_path, &verify_config);

