Lingjia007/STM32F407_Bootloader/IAP/menu.c
  if (verify_result == ED25519_VERIFY_OK)
  {
    menu_service_println(ctx, "Ed25519 signature verification PASSED!");
    menu_service_println(ctx, "Firmware integrity confirmed.");
  }
  else
  {
    menu_service_print(ctx, "Ed25519 signature verification FAILED! ");
    menu_service_println(ctx, ed25519_verify_err_to_string(verify_result));
  }
}

static void cmd_ed25519_verify_sdcard(menu_ctx_t *ctx, int argc, char *argv[])
{
  FRESULT res;
  char msg[256];
  ed25519_storage_ctx_t storage = {"SD card", "0:/", "0:/", NULL};

  menu_service_println(ctx, "Initializing TF card...");
  res = f_mount(&SDFatFS, (TCHAR const *)SDPath, 1);
  if (res != FR_OK)
  {
    menu_service_print(ctx, "Error: SD card mount failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, res);
    menu_service_println(ctx, msg);
    return;
  }

  platform_fs_fatfs_register(&g_fs_fatfs, &SDFatFS, "fatfs");
  storage.fs = &g_fs_fatfs.base;

  cmd_ed25519_verify_workflow(ctx, &storage);

  f_mount(NULL, (TCHAR const *)SDPath, 0);
}

static void cmd_ed25519_verify_spi(menu_ctx_t *ctx, int argc, char *argv[])
{
  int res;
  lfs_t lfs;
  ed25519_storage_ctx_t storage = {"SPI Flash", "/", "", NULL};

  menu_service_println(ctx, "Initializing SPI Flash...");
  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(ctx, "Error: SPI Flash initialization failed!");
    return;
  }

  menu_service_println(ctx, "Mounting LittleFS...");
  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(ctx, "Error: LittleFS mount failed!");
    return;
  }

  platform_fs_lfs_register(&g_fs_lfs, &lfs, "lfs");
  storage.fs = &g_fs_lfs.base;

  cmd_ed25519_verify_workflow(ctx, &storage);

  lfs_spi_flash_unmount(&lfs);
}

static void cmd_ed25519_verify_buffer_test(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t test_message[] = "Hello, Ed25519!";
  uint8_t test_public_key[EDSIGN_PUBLIC_KEY_SIZE] = {0};
  uint8_t test_secret_key[EDSIGN_SECRET_KEY_SIZE] = {0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08,
                                                     0x09, 0x0a, 0x0b, 0x0c, 0x0d, 0x0e, 0x0f, 0x10,
                                                     0x11, 0x12, 0x13, 0x14, 0x15, 0x16, 0x17, 0x18,
                                                     0x19, 0x1a, 0x1b, 0x1c, 0x1d, 0x1e, 0x1f, 0x20};
  uint8_t test_signature[EDSIGN_SIGNATURE_SIZE];
  int verify_result;
  char msg[128];

  menu_service_println(ctx, "Running Ed25519 buffer verify test...");

  edsign_sec_to_pub(test_public_key, test_secret_key);
  edsign_sign(test_signature, test_public_key, test_secret_key,
              test_message, sizeof(test_message) - 1);

  menu_service_println(ctx, "Test message: \"Hello, Ed25519!\"");
  snprintf(msg, sizeof(msg), "Public key: %02X%02X%02X%02X...",
           test_public_key[0], test_public_key[1],
           test_public_key[2], test_public_key[3]);
  menu_service_println(ctx, msg);
  snprintf(msg, sizeof(msg), "Signature: %02X%02X%02X%02X...%02X%02X%02X%02X",
           test_signature[0], test_signature[1],
           test_signature[2], test_signature[3],
           test_signature[60], test_signature[61],
           test_signature[62], test_signature[63]);
  menu_service_println(ctx, msg);

  verify_result = ed25519_verify_buffer(test_message, sizeof(test_message) - 1,
                                        test_signature, test_public_key);

  if (verify_result == ED25519_VERIFY_OK)
    menu_service_println(ctx, "Buffer verify test PASSED!");
  else
  {
    menu_service_print(ctx, "Buffer verify test FAILED! ");
    menu_service_println(ctx, ed25519_verify_err_to_string(verify_result));
  }

  test_signature[0] ^= 0xFF;
  verify_result = ed25519_verify_buffer(test_message, sizeof(test_message) - 1,
                                        test_signature, test_public_key);

  if (verify_result == ED25519_VERIFY_ERR_FAILED)
    menu_service_println(ctx, "Tampered signature test PASSED (correctly rejected)!");
  else
    menu_service_println(ctx, "Tampered signature test FAILED (should have been rejected)!");
}
#endif

static void cmd_ab_show_status(menu_ctx_t *ctx, int argc, char *argv[])
{
  char msg[256];
  const ab_metadata_t *meta = ab_partition_get_metadata();

  menu_service_println(ctx, "");
  menu_service_println(ctx, "======== A/B Partition Status ========");
  snprintf(msg, sizeof(msg), "  Active Slot:     %s", ab_slot_name(meta->active_slot));
  menu_service_println(ctx, msg);
  snprintf(msg, sizeof(msg), "  Metadata Magic:  0x%08lX", (unsigned long)meta->magic);
  menu_service_println(ctx, msg);
  snprintf(msg, sizeof(msg), "  Metadata Ver:    %lu", (unsigned long)meta->version);
  menu_service_println(ctx, msg);

  for (int s = 0; s < 2; s++)
  {
    const char *state_str = "UNKNOWN";
    switch (meta->slots[s].state)
    {
    case AB_STATE_IDLE:
      state_str = "IDLE";
      break;
    case AB_STATE_TESTING:
      state_str = "TESTING";
      break;
    case AB_STATE_CONFIRMED:
      state_str = "CONFIRMED";
      break;
    case AB_STATE_INVALID:
      state_str = "INVALID";
      break;
    default:
      break;
    }

    menu_service_println(ctx, "");
    snprintf(msg, sizeof(msg), "  --- Slot %s (0x%08lX) ---",
             ab_slot_name((ab_slot_t)s),
             (unsigned long)ab_partition_get_slot_addr((ab_slot_t)s));
    menu_service_println(ctx, msg);
    snprintf(msg, sizeof(msg), "  State:           %s", state_str);
    menu_service_println(ctx, msg);
    {
      uint32_t fw_ver = meta->slots[s].fw_version;
      uint8_t major = (fw_ver >> 16) & 0xFF;
      uint8_t minor = (fw_ver >> 8) & 0xFF;
      uint8_t patch = fw_ver & 0xFF;
      if (fw_ver != 0)
      {
        snprintf(msg, sizeof(msg), "  FW Version:      V%u.%u.%u (%lu)", major, minor, patch, (unsigned long)fw_ver);
      }
      else
      {
        snprintf(msg, sizeof(msg), "  FW Version:      %lu", (unsigned long)fw_ver);
      }
    }
    menu_service_println(ctx, msg);
    snprintf(msg, sizeof(msg), "  Security Ctr:    %lu", (unsigned long)meta->slots[s].security_counter);
    menu_service_println(ctx, msg);
    snprintf(msg, sizeof(msg), "  FW Size:         %lu", (unsigned long)meta->slots[s].fw_size);
    menu_service_println(ctx, msg);
    snprintf(msg, sizeof(msg), "  Boot Attempts:   %d", meta->slots[s].boot_attempts);
    menu_service_println(ctx, msg);

