Lingjia007/STM32F407_Bootloader/IAP/menu.c
    ab_err_t val = ab_partition_validate_slot((ab_slot_t)s);
    snprintf(msg, sizeof(msg), "  FW Valid:        %s", (val == AB_OK) ? "YES" : "NO");
    menu_service_println(ctx, msg);

    int sha256_nonzero = 0;
    for (int i = 0; i < AB_SHA256_SIZE; i++)
    {
      if (meta->slots[s].sha256[i] != 0)
      {
        sha256_nonzero = 1;
        break;
      }
    }

    if (sha256_nonzero)
    {
      static char hex_buf[65];
      for (int i = 0; i < 32; i++)
        snprintf(&hex_buf[i * 2], sizeof(hex_buf) - i * 2, "%02X", meta->slots[s].sha256[i]);
      hex_buf[64] = '\0';
      snprintf(msg, sizeof(msg), "  SHA256:          %s", hex_buf);
      menu_service_println(ctx, msg);
    }
    else
    {
      menu_service_println(ctx, "  SHA256:          (not set)");
    }
  }

  menu_service_println(ctx, "");
  menu_service_println(ctx, "  --- Memory Map ---");
  snprintf(msg, sizeof(msg), "  Bootloader:  0x%08X - 0x%08X (128KB)", 0x08000000, 0x0801FFFF);
  menu_service_println(ctx, msg);
  snprintf(msg, sizeof(msg), "  Slot A:      0x%08X - 0x%08X (384KB)", SLOT_A_START_ADDR, SLOT_A_END_ADDR);
  menu_service_println(ctx, msg);
  snprintf(msg, sizeof(msg), "  Slot B:      0x%08X - 0x%08X (384KB)", SLOT_B_START_ADDR, SLOT_B_END_ADDR);
  menu_service_println(ctx, msg);
  snprintf(msg, sizeof(msg), "  Cache:       0x%08X - 0x%08X (64KB)", DOWNLOAD_CACHE_ADDR, DOWNLOAD_CACHE_ADDR + DOWNLOAD_CACHE_SIZE - 1);
  menu_service_println(ctx, msg);
  snprintf(msg, sizeof(msg), "  Metadata:    0x%08X - 0x%08X (64KB)", METADATA_ADDR, METADATA_ADDR + METADATA_SIZE - 1);
  menu_service_println(ctx, msg);
  menu_service_println(ctx, "=======================================");
}

static void cmd_ab_set_active(menu_ctx_t *ctx, int argc, char *argv[])
{
  char msg[128];
  uint8_t key = 0;
  ab_slot_t target;

  menu_service_print(ctx, "\r\nSet active slot: A(1) or B(2)? ");
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '1')
    {
      target = AB_SLOT_A;
      break;
    }
    else if (key == '2')
    {
      target = AB_SLOT_B;
      break;
    }
    else if (key == 'q' || key == 'Q')
    {
      menu_service_println(ctx, "\rAborted.");
      return;
    }
  }

  ab_err_t err = ab_partition_set_active_slot(target);
  if (err == AB_OK)
  {
    snprintf(msg, sizeof(msg), "\r\nActive slot set to %s (TESTING)", ab_slot_name(target));
    menu_service_println(ctx, msg);
  }
  else
  {
    snprintf(msg, sizeof(msg), "\r\nFailed: %s", ab_err_str(err));
    menu_service_println(ctx, msg);
  }
}

static void cmd_ab_confirm_slot(menu_ctx_t *ctx, int argc, char *argv[])
{
  char msg[128];
  ab_slot_t active = ab_partition_get_active_slot();

  ab_err_t err = ab_partition_mark_slot_confirmed(active);
  if (err == AB_OK)
  {
    snprintf(msg, sizeof(msg), "Slot %s marked as CONFIRMED", ab_slot_name(active));
    menu_service_println(ctx, msg);
  }
  else
  {
    snprintf(msg, sizeof(msg), "Failed: %s", ab_err_str(err));
    menu_service_println(ctx, msg);
  }
}

static void cmd_ab_rollback(menu_ctx_t *ctx, int argc, char *argv[])
{
  char msg[128];

  menu_service_print(ctx, "\r\nRollback to previous slot? (y/n): ");
  menu_service_flush(ctx);

  uint8_t key = 0;
  menu_service_getchar(ctx, &key, RX_TIMEOUT);
  if (key != 'y' && key != 'Y')
  {
    menu_service_println(ctx, "\rAborted.");
    return;
  }

  ab_err_t err = ab_partition_rollback();
  if (err == AB_OK)
  {
    snprintf(msg, sizeof(msg), "Rolled back to Slot %s", ab_slot_name(ab_partition_get_active_slot()));
    menu_service_println(ctx, msg);
  }
  else
  {
    snprintf(msg, sizeof(msg), "Rollback failed: %s", ab_err_str(err));
    menu_service_println(ctx, msg);
  }
}

static void cmd_ab_jump_slot(menu_ctx_t *ctx, int argc, char *argv[])
{
  char msg[128];
  uint8_t key = 0;
  ab_slot_t target;

  menu_service_print(ctx, "\r\nJump to slot: A(1) or B(2)? ");
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '1')
    {
      target = AB_SLOT_A;
      break;
    }
    else if (key == '2')
    {
      target = AB_SLOT_B;
      break;
    }
    else if (key == 'q' || key == 'Q')
    {
      menu_service_println(ctx, "\rAborted.");
      return;
    }
  }

  ab_err_t val = ab_partition_validate_slot(target);
  if (val != AB_OK)
  {
    snprintf(msg, sizeof(msg), "Slot %s has no valid firmware!", ab_slot_name(target));
    menu_service_println(ctx, msg);
    return;
  }

  snprintf(msg, sizeof(msg), "Jumping to Slot %s (0x%08lX)...",
           ab_slot_name(target), (unsigned long)ab_partition_get_slot_addr(target));
  menu_service_println(ctx, msg);

  bootloader_ctx.ab_active_slot = target;
  bootloader_request_jump(target);
}

MENU_TABLE(ab_menu) = {
    MENU_ITEM_CMD("1", "Show A/B Partition Status", "Display slot info and memory map", cmd_ab_show_status),
    MENU_ITEM_CMD("2", "Set Active Slot", "Switch active slot (A or B)", cmd_ab_set_active),
    MENU_ITEM_CMD("3", "Confirm Current Slot", "Mark active slot as confirmed", cmd_ab_confirm_slot),
    MENU_ITEM_CMD("4", "Rollback", "Rollback to previous slot", cmd_ab_rollback),
    MENU_ITEM_CMD("5", "Jump to Slot", "Directly jump to A or B slot", cmd_ab_jump_slot),
    MENU_ITEM_BACK(),
    MENU_TABLE_END};

#if MENU_ENABLE_ESP8266_WIFI
MENU_TABLE(mqtt_menu) = {
    MENU_ITEM_CMD("1", "Check MQTT Connection Status", "Query current MQTT connection", cmd_mqtt_check_status),
    MENU_ITEM_CMD("2", "Configure MQTT User", "Set client ID, username, password", cmd_mqtt_configure),
    MENU_ITEM_CMD("3", "Connect to MQTT Server", "Connect to OneNET MQTT broker", cmd_mqtt_connect),
    MENU_ITEM_CMD("4", "Subscribe Property Topics", "Subscribe to all property topics", cmd_mqtt_subscribe),
    MENU_ITEM_CMD("5", "Publish Property", "Publish a single property value", cmd_mqtt_publish),
    MENU_ITEM_CMD("6", "Listen & Auto Reply Property Set", "Listen for property set commands", cmd_mqtt_listen),
    MENU_ITEM_CMD("7", "Disconnect MQTT", "Disconnect from MQTT broker", cmd_mqtt_disconnect),
    MENU_ITEM_CMD("8", "Sync Time (SNTP)", "Synchronize RTC from NTP server", cmd_mqtt_sync_time),
    MENU_ITEM_CMD("9", "Publish RTC Time (1s interval)", "Publish RTC time periodically", cmd_mqtt_publish_rtc),
    MENU_ITEM_BACK(),
    MENU_TABLE_END};

MENU_TABLE(esp8266_menu) = {
    MENU_ITEM_CMD("1", "WiFi Init & Connect AP", "Initialize ESP8266 and connect", cmd_esp8266_init),
    MENU_ITEM_CMD("2", "AT Command Test", "Test ESP8266 AT communication", cmd_esp8266_at_test),
    MENU_ITEM_CMD("3", "TCP Connect Test", "Connect to TCP server", cmd_esp8266_tcp_connect),
    MENU_ITEM_CMD("4", "Enter Transparent Mode", "Enable transparent transmission", cmd_esp8266_transparent_enter),
    MENU_ITEM_CMD("5", "Exit Transparent Mode", "Disable transparent transmission", cmd_esp8266_transparent_exit),
    MENU_ITEM_CMD("6", "Set OTA Target: Internal Flash", "OTA downloads to internal flash", cmd_ota_target_internal),
    MENU_ITEM_CMD("7", "Set OTA Target: SD Card (FATFS)", "OTA downloads to SD card", cmd_ota_target_sdcard),
    MENU_ITEM_CMD("8", "Set OTA Target: SPI Flash (LFS)", "OTA downloads to SPI flash", cmd_ota_target_spi),
    MENU_ITEM_CMD("9", "OneNET OTA Download", "Start OTA download from OneNET", cmd_onenet_ota_download),
    MENU_ITEM_CMD("A", "Show Current Time", "Display RTC time and timestamp", cmd_show_time),
    MENU_ITEM_SUBMENU("B", "MQTT Test Menu", "MQTT protocol testing", mqtt_menu, sizeof(mqtt_menu) / sizeof(mqtt_menu[0]) - 1),
    MENU_ITEM_BACK(),
    MENU_TABLE_END};
#endif

