Lingjia007/STM32F407_Bootloader/IAP/menu.c
#if MENU_ENABLE_SPI_FLASH_STORE
MENU_TABLE(store_menu) = {
    MENU_ITEM_CMD("1", "Store image from TF card", "Copy from SD to SPI Flash", cmd_store_from_tf),
    MENU_ITEM_CMD("2", "Store image from Flash", "Copy from internal Flash to SPI Flash", cmd_store_from_flash),
    MENU_ITEM_CMD("3", "Show stored images", "List images in SPI Flash", cmd_show_stored),
    MENU_ITEM_CMD("4", "Delete stored image", "Remove image from SPI Flash", cmd_delete_stored),
    MENU_ITEM_CMD("5", "Delete entire file system", "Format SPI Flash", cmd_delete_fs),
    MENU_ITEM_BACK(),
    MENU_TABLE_END};
#endif

#if MENU_ENABLE_DOWNLOAD
MENU_TABLE(download_menu) = {
    MENU_ITEM_CMD("1", "Download via Serial (Ymodem)", "Receive firmware via Ymodem", cmd_serial_download),
    MENU_ITEM_CMD("2", "Download from SD card (FATFS)", "Read firmware from SD card", cmd_sdcard_download),
    MENU_ITEM_CMD("3", "Download from SPI Flash (LittleFS)", "Read firmware from SPI Flash", cmd_spi_flash_download),
    MENU_ITEM_BACK(),
    MENU_TABLE_END};
#endif

#if MENU_ENABLE_AES_DECRYPT
MENU_TABLE(decrypt_menu) = {
    MENU_ITEM_CMD("1", "Decrypt from SD card and download to Flash", "Decrypt .bin.aes and write to Flash", cmd_decrypt_download_sdcard),
    MENU_ITEM_CMD("2", "Decrypt from SPI Flash and download to Flash", "Decrypt .bin.aes and write to Flash", cmd_decrypt_download_spi),
    MENU_ITEM_BACK(),
    MENU_TABLE_END};
#endif

#if MENU_ENABLE_HPATCH
MENU_TABLE(hpatch_menu) = {
    MENU_ITEM_CMD("1", "HPatch upgrade from SD card", "Apply .hdiff patch from SD card", cmd_hpatch_sdcard),
    MENU_ITEM_CMD("2", "HPatch upgrade from SPI Flash", "Apply .hdiff patch from SPI Flash", cmd_hpatch_spi),
    MENU_ITEM_BACK(),
    MENU_TABLE_END};
#endif

#if MENU_ENABLE_ED25519_VERIFY
MENU_TABLE(ed25519_menu) = {
    MENU_ITEM_CMD("1", "Verify firmware on SD card", "Verify .bin signature from SD card", cmd_ed25519_verify_sdcard),
    MENU_ITEM_CMD("2", "Verify firmware on SPI Flash", "Verify .bin signature from SPI Flash", cmd_ed25519_verify_spi),
    MENU_ITEM_CMD("3", "Buffer verify test", "Self-test Ed25519 sign and verify", cmd_ed25519_verify_buffer_test),
    MENU_ITEM_BACK(),
    MENU_TABLE_END};
#endif

#if MENU_ENABLE_FIRMWARE_PACKAGE
MENU_TABLE(fw_pkg_menu) = {
    MENU_ITEM_CMD("1", "Parse package from SD card (FATFS)", "Parse .iap.bin and save decrypted to SD", cmd_fw_pkg_sdcard),
    MENU_ITEM_CMD("2", "Parse package from SPI Flash (LFS)", "Parse .iap.bin and save decrypted to SPI", cmd_fw_pkg_spi),
    MENU_ITEM_CMD("3", "Secure Download to A/B (SD Card)", "Download to inactive A/B slot from SD", cmd_secure_download_sdcard),
    MENU_ITEM_CMD("4", "Secure Download to A/B (SPI Flash)", "Download to inactive A/B slot from SPI", cmd_secure_download_spi),
    MENU_ITEM_BACK(),
    MENU_TABLE_END};
#endif

#if MENU_ENABLE_RNG_DEVKEY
static void cmd_rng_generate_devkey(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint32_t random_values[4];
  uint8_t devkey[16];
  HAL_StatusTypeDef status;
  int i;

  menu_service_println(ctx, "Generating 128-bit device key from RNG...");

  for (i = 0; i < 4; i++)
  {
    status = HAL_RNG_GenerateRandomNumber(&hrng, &random_values[i]);
    if (status != HAL_OK)
    {
      menu_service_print(ctx, "Error: RNG generation failed at step ");
      char err_msg[32];
      snprintf(err_msg, sizeof(err_msg), "%d, error code: %d", i + 1, status);
      menu_service_println(ctx, err_msg);
      return;
    }
  }

  for (i = 0; i < 4; i++)
  {
    devkey[i * 4 + 0] = (random_values[i] >> 24) & 0xFF;
    devkey[i * 4 + 1] = (random_values[i] >> 16) & 0xFF;
    devkey[i * 4 + 2] = (random_values[i] >> 8) & 0xFF;
    devkey[i * 4 + 3] = (random_values[i] >> 0) & 0xFF;
  }

  menu_service_println(ctx, "Device Key (128-bit):");
  static char hex_str[64];
  for (i = 0; i < 16; i++)
  {
    snprintf(&hex_str[i * 2], 3, "%02X", devkey[i]);
  }
  hex_str[32] = '\0';
  menu_service_println(ctx, hex_str);

  menu_service_println(ctx, "Formatted:");
  static char formatted_str[64];
  int pos = 0;
  for (i = 0; i < 16; i++)
  {
    snprintf(&formatted_str[pos], 4, "%02X ", devkey[i]);
    pos += 3;
    if ((i + 1) % 4 == 0 && i < 15)
    {
      formatted_str[pos++] = ' ';
    }
  }
  formatted_str[pos] = '\0';
  menu_service_println(ctx, formatted_str);

  menu_service_println(ctx, "Raw values (hex):");
  for (i = 0; i < 4; i++)
  {
    char line[32];
    snprintf(line, sizeof(line), "  R%d: 0x%08lX", i + 1, (unsigned long)random_values[i]);
    menu_service_println(ctx, line);
  }

  menu_service_println(ctx, "");
  menu_service_println(ctx, "=== Chip Unique Device ID (96-bit) ===");
  uint32_t uid_words[3];
  uid_words[0] = *(volatile uint32_t *)(UID_BASE);
  uid_words[1] = *(volatile uint32_t *)(UID_BASE + 4);
  uid_words[2] = *(volatile uint32_t *)(UID_BASE + 8);

  static char uid_uuid_str[40];
  snprintf(uid_uuid_str, sizeof(uid_uuid_str), "%08lX-%08lX-%08lX",
           (unsigned long)uid_words[2], (unsigned long)uid_words[1], (unsigned long)uid_words[0]);
  menu_service_print(ctx, "Device UID: ");
  menu_service_println(ctx, uid_uuid_str);

  static char uid_hex_str[32];
  uint8_t *uid_bytes = (uint8_t *)uid_words;
  for (i = 0; i < 12; i++)
  {
    snprintf(&uid_hex_str[i * 2], 3, "%02X", uid_bytes[i]);
  }
  uid_hex_str[24] = '\0';
  menu_service_print(ctx, "UID (bytes): ");
  menu_service_println(ctx, uid_hex_str);

  menu_service_println(ctx, "");
  menu_service_println(ctx, "=== OTP Memory (528 bytes) ===");

  menu_service_println(ctx, "--- Device Key (16 bytes) ---");
  uint32_t devkey_words[4];
  uint8_t *devkey_bytes = (uint8_t *)devkey_words;
  for (i = 0; i < 4; i++)
  {
    devkey_words[i] = *(volatile uint32_t *)(FLASH_OTP_BASE + i * 4);
  }

  static char devkey_hex[40];
  for (i = 0; i < 16; i++)
  {
    snprintf(&devkey_hex[i * 2], 3, "%02X", devkey_bytes[i]);
  }
  devkey_hex[32] = '\0';
  menu_service_print(ctx, "DevKey: ");
  menu_service_println(ctx, devkey_hex);

  static char devkey_formatted[64];
  int dk_pos = 0;
  for (i = 0; i < 16; i++)
  {
    snprintf(&devkey_formatted[dk_pos], 4, "%02X ", devkey_bytes[i]);
    dk_pos += 3;
    if ((i + 1) % 4 == 0 && i < 15)
    {
      devkey_formatted[dk_pos++] = ' ';
    }
  }
  devkey_formatted[dk_pos] = '\0';
  menu_service_println(ctx, devkey_formatted);

  menu_service_println(ctx, "");
  menu_service_println(ctx, "--- User Data (512 bytes) ---");
  volatile uint8_t *otp_user = (volatile uint8_t *)(FLASH_OTP_BASE + 16);
  static char otp_line[64];
  int row, col;
  for (row = 0; row < 32; row++)
  {
    int line_pos = 0;
    snprintf(otp_line, sizeof(otp_line), "%03X: ", 16 + row * 16);
    line_pos = 5;
    for (col = 0; col < 16; col++)
    {
      snprintf(&otp_line[line_pos], 4, "%02X ", otp_user[row * 16 + col]);
      line_pos += 3;
    }
    otp_line[line_pos] = '\0';
    menu_service_println(ctx, otp_line);
  }
}

static void cmd_write_otp_devkey(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint32_t random_values[4];
  uint8_t devkey[16];
  HAL_StatusTypeDef status;
  int i;

  menu_service_println(ctx, "Checking OTP status...");
  uint8_t otp_empty = 1;
  for (i = 0; i < 4; i++)
  {
    if (*(volatile uint32_t *)(FLASH_OTP_BASE + i * 4) != 0xFFFFFFFF)
    {
      otp_empty = 0;
      break;
    }
  }

