Lingjia007/STM32F407_Bootloader/IAP/menu.c
  if (!otp_empty)
  {
    menu_service_println(ctx, "Error: OTP already programmed!");
    menu_service_println(ctx, "OTP can only be written once.");
    uint32_t existing_words[4];
    uint8_t *existing_bytes = (uint8_t *)existing_words;
    for (i = 0; i < 4; i++)
    {
      existing_words[i] = *(volatile uint32_t *)(FLASH_OTP_BASE + i * 4);
    }
    static char existing_hex[40];
    for (i = 0; i < 16; i++)
    {
      snprintf(&existing_hex[i * 2], 3, "%02X", existing_bytes[i]);
    }
    existing_hex[32] = '\0';
    menu_service_print(ctx, "Current OTP: ");
    menu_service_println(ctx, existing_hex);
    return;
  }

  menu_service_println(ctx, "Generating 128-bit device key...");
  for (i = 0; i < 4; i++)
  {
    status = HAL_RNG_GenerateRandomNumber(&hrng, &random_values[i]);
    if (status != HAL_OK)
    {
      menu_service_println(ctx, "Error: RNG generation failed!");
      return;
    }
  }

  for (i = 0; i < 4; i++)
  {
    devkey[i * 4 + 0] = (random_values[i] >> 24) & 0xFF;
    devkey[i * 4 + 1] = (random_values[i] >> 16) & 0xFF;
    devkey[i * 4 + 2] = (random_values[i] >> 8) & 0xFF;
    devkey[i * 4 + 3] = (random_values[i] >> 0) & 0xFF;
  }

  static char key_hex[40];
  for (i = 0; i < 16; i++)
  {
    snprintf(&key_hex[i * 2], 3, "%02X", devkey[i]);
  }
  key_hex[32] = '\0';
  menu_service_print(ctx, "Device Key: ");
  menu_service_println(ctx, key_hex);

  menu_service_println(ctx, "Writing to OTP...");
  HAL_FLASH_Unlock();

  status = HAL_OK;
  for (i = 0; i < 4; i++)
  {
    uint32_t address = FLASH_OTP_BASE + (i * 4);
    if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address, random_values[i]) != HAL_OK)
    {
      status = HAL_ERROR;
      break;
    }
  }

  HAL_FLASH_Lock();

  if (status != HAL_OK)
  {
    menu_service_println(ctx, "Error: OTP write failed!");
    return;
  }

  menu_service_println(ctx, "OTP write successful!");
  menu_service_println(ctx, "");
  menu_service_println(ctx, "Verifying...");

  uint32_t otp_words[4];
  for (i = 0; i < 4; i++)
  {
    otp_words[i] = *(volatile uint32_t *)(FLASH_OTP_BASE + i * 4);
  }

  static char verify_hex[40];
  uint8_t *otp_bytes = (uint8_t *)otp_words;
  for (i = 0; i < 16; i++)
  {
    snprintf(&verify_hex[i * 2], 3, "%02X", otp_bytes[i]);
  }
  verify_hex[32] = '\0';
  menu_service_print(ctx, "OTP: ");
  menu_service_println(ctx, verify_hex);

  int verify_ok = 1;
  for (i = 0; i < 4; i++)
  {
    if (otp_words[i] != random_values[i])
    {
      verify_ok = 0;
      break;
    }
  }

  if (verify_ok)
  {
    menu_service_println(ctx, "Verification: PASSED");
  }
  else
  {
    menu_service_println(ctx, "Verification: FAILED!");
  }
}
#endif

MENU_TABLE(main_menu) = {
#if MENU_ENABLE_DOWNLOAD
    MENU_ITEM_SUBMENU("1", "Download image to internal Flash", "Firmware download options", download_menu, sizeof(download_menu) / sizeof(download_menu[0]) - 1),
#endif
#if MENU_ENABLE_UPLOAD
    MENU_ITEM_CMD("2", "Upload image from internal Flash", "Send firmware via Ymodem", cmd_serial_upload),
#endif
#if MENU_ENABLE_SPI_FLASH_STORE
    MENU_ITEM_SUBMENU("3", "Store image to SPI-Flash LFS", "SPI Flash storage management", store_menu, sizeof(store_menu) / sizeof(store_menu[0]) - 1),
#endif
#if MENU_ENABLE_EXECUTE_APP
    MENU_ITEM_CMD("4", "Execute the loaded application", "Jump to application firmware", cmd_execute_app),
#endif
#if MENU_ENABLE_FLASH_PROTECTION
    MENU_ITEM_CMD("5", "Toggle Flash write protection", "Enable/disable write protection", cmd_flash_protection),
#endif
#if MENU_ENABLE_AES_DECRYPT
    MENU_ITEM_SUBMENU("6", "Decrypt and download encrypted firmware", "AES decryption options", decrypt_menu, sizeof(decrypt_menu) / sizeof(decrypt_menu[0]) - 1),
    MENU_ITEM_CMD("7", "Decrypt .bin.aes file on SD card", "Decrypt and save to SD card", cmd_decrypt_sdcard),
#endif
#if MENU_ENABLE_HPATCH
    MENU_ITEM_SUBMENU("8", "HPatch differential upgrade", "Differential firmware update", hpatch_menu, sizeof(hpatch_menu) / sizeof(hpatch_menu[0]) - 1),
#endif
#if MENU_ENABLE_UART_PASSTHROUGH
    MENU_ITEM_CMD("9", "UART4 <-> USART1 Passthrough", "Transparent UART bridge", cmd_uart_passthrough),
#endif
#if MENU_ENABLE_ESP8266_WIFI
    MENU_ITEM_SUBMENU("A", "ESP8266 WiFi & OTA Test", "WiFi and OTA testing", esp8266_menu, sizeof(esp8266_menu) / sizeof(esp8266_menu[0]) - 1),
#endif
#if MENU_ENABLE_ED25519_VERIFY
    MENU_ITEM_SUBMENU("B", "Ed25519 Signature Verify", "Firmware signature verification", ed25519_menu, sizeof(ed25519_menu) / sizeof(ed25519_menu[0]) - 1),
#endif
#if MENU_ENABLE_RNG_DEVKEY
    MENU_ITEM_CMD("C", "Generate Device Key (RNG)", "Generate 128-bit random device key", cmd_rng_generate_devkey),
    MENU_ITEM_CMD("D", "Write DevKey to OTP", "Generate and write 128-bit key to OTP", cmd_write_otp_devkey),
#endif
#if MENU_ENABLE_FIRMWARE_PACKAGE
    MENU_ITEM_SUBMENU("E", "Firmware Package Parse", "Parse .iap.bin package and decrypt", fw_pkg_menu, sizeof(fw_pkg_menu) / sizeof(fw_pkg_menu[0]) - 1),
#endif
    MENU_ITEM_SUBMENU("F", "A/B Partition Management", "View status, swap, rollback slots", ab_menu, sizeof(ab_menu) / sizeof(ab_menu[0]) - 1),
    MENU_TABLE_END};

void Main_Menu(void)
{
  menu_service_init(&g_menu_ctx, (platform_uart_base_t *)&g_uart4_console.base);
  menu_service_set_root(&g_menu_ctx, main_menu, sizeof(main_menu) / sizeof(main_menu[0]) - 1);
  menu_service_set_prompt(&g_menu_ctx, "STM32F4xx IAP Menu");

  menu_service_run(&g_menu_ctx);
}

/**
 * @}
 */
